{
  "letter": "h",
  "count": 65,
  "terms": [
    {
      "id": "term-habana",
      "term": "Habana Labs",
      "definition": "An Intel subsidiary producing the Gaudi series of AI training accelerators featuring integrated RoCE networking and high memory bandwidth. Habana Gaudi processors offer a cost-effective alternative to NVIDIA GPUs for large-scale model training.",
      "tags": [
        "Hardware",
        "Distributed Computing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hallucination",
      "term": "Hallucination",
      "definition": "When AI generates information that sounds plausible but is actually incorrect or fabricated. Includes fake citations, invented statistics, and fictional events. A major challenge in LLM reliability.",
      "tags": [
        "Limitation",
        "Risk"
      ],
      "domain": "safety",
      "link": "../tools/hallucination.html",
      "related": []
    },
    {
      "id": "term-hallucination-mitigation",
      "term": "Hallucination Mitigation",
      "definition": "A collection of techniques designed to reduce factually incorrect or fabricated content in LLM outputs, including retrieval augmentation, self-consistency checks, and citation-based grounding.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hallucination-rate",
      "term": "Hallucination Rate",
      "definition": "A metric that quantifies the proportion of generated content that contains fabricated facts, unsupported claims, or information contradicting the source material, serving as a key safety and reliability indicator for language models.",
      "tags": [
        "Evaluation",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-halting-problem",
      "term": "Halting Problem",
      "definition": "A decision problem proved undecidable by Alan Turing in 1936. The halting problem asks whether a given program will eventually halt or run forever. Turing's proof established fundamental limits on what computers can compute influencing theoretical computer science and AI.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hamiltonian-monte-carlo",
      "term": "Hamiltonian Monte Carlo",
      "definition": "An MCMC method that uses Hamiltonian dynamics to propose distant samples with high acceptance probability, reducing random walk behavior and improving exploration efficiency for high-dimensional distributions.",
      "tags": [
        "Statistics",
        "Bayesian Methods"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hamming-distance",
      "term": "Hamming Distance",
      "definition": "The number of positions at which corresponding symbols in two equal-length strings or vectors differ. It is used as a metric for comparing binary codes, error detection, and evaluating multi-label classification.",
      "tags": [
        "Machine Learning",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hand-pose-estimation",
      "term": "Hand Pose Estimation",
      "definition": "The task of predicting the 3D positions of hand joints and fingertips from images or depth sensors, enabling gesture recognition and hand tracking for VR/AR and sign language applications.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hans-moravec",
      "term": "Hans Moravec",
      "definition": "Austrian-Canadian roboticist at Carnegie Mellon University known for Moravec's Paradox and pioneering work in mobile robot navigation. His books Mind Children (1988) and Robot (1999) explored the future of artificial intelligence and robotics.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-attention",
      "term": "Hard Attention",
      "definition": "An attention mechanism that selects discrete positions to attend to rather than computing weighted averages, requiring reinforcement learning or straight-through estimators for training.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-sigmoid",
      "term": "Hard Sigmoid",
      "definition": "A piecewise linear approximation of the sigmoid function that is computationally cheaper to evaluate. Defined as f(x) = clip((x + 1) / 2 at 0 and 1). Used in mobile and embedded applications where computational efficiency is critical.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-swish",
      "term": "Hard Swish",
      "definition": "A piecewise linear approximation of the Swish activation function designed for efficient inference on mobile devices. Used in MobileNetV3 and defined as f(x) = x * hard_sigmoid(x). Balances accuracy and computational cost.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hate-speech-detection",
      "term": "Hate Speech Detection",
      "definition": "The task of automatically identifying text that expresses hatred toward a group based on attributes like race, gender, or religion, used in content moderation and online safety systems.",
      "tags": [
        "NLP",
        "Text Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hazard-function",
      "term": "Hazard Function",
      "definition": "The instantaneous rate at which events occur for subjects who have survived up to a given time point. It is a fundamental quantity in survival analysis, describing how the risk of an event changes over time.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-he-initialization",
      "term": "He Initialization",
      "definition": "A weight initialization strategy specifically designed for ReLU activation functions that scales the variance of initial weights by 2 divided by the number of input units.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hearsay-ii",
      "term": "Hearsay-II",
      "definition": "A speech understanding system developed at Carnegie Mellon University in the 1970s. Notable for its blackboard architecture where multiple knowledge sources cooperated to interpret spoken language. Pioneered architectural concepts used in later multi-agent AI systems.",
      "tags": [
        "History",
        "Systems"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-heatmap-prediction",
      "term": "Heatmap Prediction",
      "definition": "A technique in keypoint detection that predicts a probability heatmap for each keypoint type, with peaks indicating likely keypoint locations, providing sub-pixel localization accuracy.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hebbian-learning",
      "term": "Hebbian Learning",
      "definition": "A learning principle proposed by Donald Hebb in 1949 stating that neurons that fire together wire together, meaning synaptic connections strengthen when pre- and post-synaptic neurons are simultaneously active. This inspired neural network learning rules.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hedge-detection",
      "term": "Hedge Detection",
      "definition": "The task of identifying linguistic expressions that indicate uncertainty, speculation, or tentativeness in text, such as 'might,' 'possibly,' or 'it appears that.'",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hellaswag",
      "term": "HellaSwag",
      "definition": "A benchmark testing commonsense natural language inference. Models must select the most plausible continuation of a scenario, evaluating real-world reasoning capabilities.",
      "tags": [
        "Benchmark",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-herbert-gelernter",
      "term": "Herbert Gelernter",
      "definition": "American computer scientist who created the Geometry Theorem Prover in 1959 at IBM. The program could prove theorems in Euclidean geometry from axioms and represented an early success in automated reasoning and mathematical problem solving by computers.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-herbert-simon",
      "term": "Herbert Simon",
      "definition": "American political scientist, economist, and AI pioneer (1916-2001) who co-created the Logic Theorist and General Problem Solver, developed bounded rationality theory, and won the Nobel Prize in Economics in 1978.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-heteroscedasticity",
      "term": "Heteroscedasticity",
      "definition": "A condition in regression analysis where the variance of the residuals is not constant across all levels of the independent variables. It violates a key assumption of ordinary least squares and can bias standard error estimates.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-heuristic",
      "term": "Heuristic",
      "definition": "A practical rule or strategy that helps solve problems or make decisions quickly, even if not guaranteed to be optimal. Used in AI search, optimization, and rule-based systems.",
      "tags": [
        "Concept",
        "Problem Solving"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-heuristic-search",
      "term": "Heuristic Search",
      "definition": "A problem-solving approach that uses rules of thumb or estimates to guide search through a problem space more efficiently than exhaustive search. Herbert Simon popularized the term and A* search algorithm (1968) became a foundational heuristic search method in AI.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-layer",
      "term": "Hidden Layer",
      "definition": "Layers in a neural network between the input and output layers. Deep networks have many hidden layers, enabling them to learn complex hierarchical representations.",
      "tags": [
        "Architecture",
        "Neural Networks"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-markov-model",
      "term": "Hidden Markov Model",
      "definition": "A statistical model where the system is assumed to be a Markov process with unobserved (hidden) states, and observations are probabilistically dependent on the hidden state. It is widely used in speech recognition and sequence labeling.",
      "tags": [
        "Machine Learning",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-markov-models",
      "term": "Hidden Markov Models",
      "definition": "Statistical models where the system being modeled is assumed to follow a Markov process with unobserved states. HMMs became fundamental to speech recognition in the 1970s and 1980s and were also applied to bioinformatics and natural language processing.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hierarchical-clustering",
      "term": "Hierarchical Clustering",
      "definition": "A clustering approach that builds a tree-like hierarchy of clusters either by progressively merging smaller clusters (agglomerative) or by recursively splitting larger clusters (divisive), producing a dendrogram.",
      "tags": [
        "Machine Learning",
        "Clustering"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hierarchical-rl",
      "term": "Hierarchical Reinforcement Learning",
      "definition": "RL frameworks that decompose complex tasks into hierarchies of subtasks or skills operating at different temporal abstractions. Hierarchical RL enables efficient learning of long-horizon tasks through structured exploration.",
      "tags": [
        "Reinforcement Learning",
        "Multi-Agent"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm",
      "term": "High Bandwidth Memory (HBM)",
      "definition": "A high-performance DRAM technology that stacks memory dies vertically and connects them with through-silicon vias, providing significantly higher bandwidth than traditional GDDR memory. HBM2e and HBM3 are standard in AI accelerators like the A100 and H100.",
      "tags": [
        "Hardware",
        "GPU"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-high-risk-ai-systems",
      "term": "High-Risk AI Systems",
      "definition": "Under the EU AI Act, AI systems used in critical domains such as biometric identification, critical infrastructure, education, employment, law enforcement, and migration that must meet stringent requirements.",
      "tags": [
        "Governance",
        "Regulation"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-high-stakes-ai",
      "term": "High-Stakes AI",
      "definition": "AI applications where errors can have severe consequences: healthcare diagnoses, legal decisions, financial transactions. Requires extra scrutiny, testing, and often human oversight.",
      "tags": [
        "Ethics",
        "Risk"
      ],
      "domain": "safety",
      "link": "ai-safety.html",
      "related": []
    },
    {
      "id": "term-hill-climbing",
      "term": "Hill Climbing",
      "definition": "A local search optimization algorithm that iteratively moves toward higher-valued neighbors until no improvement is found. Simple and fast but easily trapped in local optima. Variants include stochastic and steepest-ascent hill climbing.",
      "tags": [
        "Algorithms",
        "Fundamentals"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hindsight-experience-replay",
      "term": "Hindsight Experience Replay (HER)",
      "definition": "A technique that augments failed trajectories by relabeling goals with actually achieved states, turning failures into successes for alternative goals. HER dramatically improves learning efficiency in goal-conditioned sparse reward environments.",
      "tags": [
        "Reinforcement Learning",
        "Training Paradigms"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hinge-loss",
      "term": "Hinge Loss",
      "definition": "A loss function used in maximum-margin classifiers such as SVMs, defined as max(0, 1 - y * f(x)). It penalizes predictions that are on the wrong side of the margin boundary.",
      "tags": [
        "Machine Learning",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-historical-bias",
      "term": "Historical Bias",
      "definition": "Bias that is encoded in data reflecting past discriminatory practices or societal inequalities, which AI systems can perpetuate even when the data accurately represents historical patterns.",
      "tags": [
        "Fairness",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-hit-rate",
      "term": "Hit Rate",
      "definition": "A retrieval metric that measures the fraction of queries for which at least one relevant document appears in the top K results, providing a simple binary assessment of retrieval success across a query set.",
      "tags": [
        "Evaluation",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hnsw",
      "term": "HNSW",
      "definition": "Hierarchical Navigable Small World, a graph-based approximate nearest neighbor algorithm that builds multi-layered proximity graphs with logarithmic search complexity, offering an excellent balance of search speed, accuracy, and memory usage for high-dimensional vector search.",
      "tags": [
        "Vector Database",
        "Index Structure"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hoeffdings-inequality",
      "term": "Hoeffding's Inequality",
      "definition": "A probability inequality that provides an upper bound on the probability that the sum of bounded independent random variables deviates from its expected value. It is used to derive generalization bounds in learning theory.",
      "tags": [
        "Statistics",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-holdout-method",
      "term": "Holdout Method",
      "definition": "The simplest model evaluation strategy that splits data into separate training and test sets, typically using 70-80% for training and the remainder for testing. Results can vary depending on the random split.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-holt-winters-method",
      "term": "Holt-Winters Method",
      "definition": "A triple exponential smoothing method for time series forecasting that captures level, trend, and seasonal components. It supports both additive and multiplicative seasonal patterns.",
      "tags": [
        "Data Science",
        "Statistics"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-homography",
      "term": "Homography",
      "definition": "A projective transformation matrix that maps points between two image planes, used for image stitching, perspective correction, and augmented reality when the scene is planar or the camera undergoes pure rotation.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-homomorphic-encryption",
      "term": "Homomorphic Encryption",
      "definition": "A cryptographic technique that allows computations to be performed on encrypted data without decrypting it first, enabling AI models to process sensitive data while maintaining privacy guarantees.",
      "tags": [
        "Privacy",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-homonymy",
      "term": "Homonymy",
      "definition": "The property of two or more words having the same spelling or pronunciation but unrelated meanings, such as 'bat' the animal and 'bat' the sporting equipment.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hopfield-network",
      "term": "Hopfield Network",
      "definition": "A recurrent neural network with symmetric connections that stores patterns as energy minima, functioning as an associative memory that retrieves stored patterns from partial or noisy inputs.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-huber-loss",
      "term": "Huber Loss",
      "definition": "A loss function that is quadratic for small residuals and linear for large residuals, combining the best properties of mean squared error and mean absolute error. It is more robust to outliers than squared error loss.",
      "tags": [
        "Machine Learning",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hubert",
      "term": "HuBERT",
      "definition": "Hidden-Unit BERT is a self-supervised speech representation model that learns from masked prediction of discrete hidden units derived from clustering. Achieves strong performance on speech recognition and spoken language understanding tasks.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hubert-dreyfus",
      "term": "Hubert Dreyfus",
      "definition": "American philosopher who was one of the earliest critics of artificial intelligence. His 1972 book What Computers Can't Do argued that AI based on symbolic processing could not replicate human intelligence which relies on intuition embodiment and social context.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hugging-face",
      "term": "Hugging Face",
      "definition": "A platform and community for sharing AI models, datasets, and applications. Hosts thousands of open-source models and the popular Transformers library for NLP.",
      "tags": [
        "Platform",
        "Open Source"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-evaluation",
      "term": "Human Evaluation",
      "definition": "The gold standard for assessing language model outputs where human annotators rate or compare generated text on dimensions such as quality, accuracy, helpfulness, and harmlessness, providing ground truth for validating automated metrics.",
      "tags": [
        "Evaluation",
        "Methodology"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-mesh-recovery",
      "term": "Human Mesh Recovery",
      "definition": "The task of estimating a full 3D human body mesh (shape and pose) from a single 2D image, using parametric body models like SMPL to represent body geometry.",
      "tags": [
        "Computer Vision",
        "3D Vision"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hitl",
      "term": "Human-in-the-Loop (HITL)",
      "definition": "A design approach where humans review, approve, or modify AI outputs before they're acted upon. Critical for high-stakes decisions, quality control, and maintaining accountability.",
      "tags": [
        "Practice",
        "Safety"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-humaneval",
      "term": "HumanEval",
      "definition": "A benchmark for evaluating code generation capabilities of LLMs. Contains programming problems with test cases, measuring how often generated code passes all tests.",
      "tags": [
        "Benchmark",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-ai",
      "term": "Hybrid AI",
      "definition": "Systems combining multiple AI approaches: neural networks with symbolic reasoning, LLMs with search, or ML with rule-based logic. Often more robust than pure approaches.",
      "tags": [
        "Architecture",
        "Design"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-retrieval",
      "term": "Hybrid Retrieval",
      "definition": "An information retrieval approach that combines sparse retrieval methods like BM25 with dense retrieval using neural embeddings. Leverages the strengths of both exact term matching and semantic similarity for improved recall and precision.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-search",
      "term": "Hybrid Search",
      "definition": "A retrieval approach that combines dense vector similarity search with traditional keyword-based (sparse) retrieval, leveraging the strengths of both methods for more robust document matching.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyena",
      "term": "Hyena",
      "definition": "A subquadratic attention replacement that uses long convolutions parameterized by implicit neural representations and multiplicative gating to achieve competitive performance with transformers at lower cost.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperband",
      "term": "Hyperband",
      "definition": "A hyperparameter optimization method that combines random search with early stopping, allocating more resources to promising configurations by successively halving the number of candidates and doubling the budget for survivors.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypernymy",
      "term": "Hypernymy",
      "definition": "A semantic relation where one word's meaning includes and is more general than another's, such as 'animal' being a hypernym of 'dog,' forming taxonomic hierarchies in lexical databases.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperparameter",
      "term": "Hyperparameter",
      "definition": "Configuration settings that control the training process rather than being learned from data. Examples include learning rate, batch size, number of layers, and dropout rate.",
      "tags": [
        "Training",
        "Configuration"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperparameter-optimization",
      "term": "Hyperparameter Optimization",
      "definition": "The process of finding optimal hyperparameter configurations for machine learning models. Methods include grid search random search Bayesian optimization and evolutionary approaches. Critical for model performance in practice.",
      "tags": [
        "Algorithms",
        "Fundamentals"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyponymy",
      "term": "Hyponymy",
      "definition": "A semantic relation where one word's meaning is more specific than and included within another's, such as 'dog' being a hyponym of 'animal,' representing an is-a relationship.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypothesis",
      "term": "Hypothesis (ML)",
      "definition": "A specific function or model that the learning algorithm considers as a possible solution. The hypothesis space is all possible hypotheses the algorithm can choose from.",
      "tags": [
        "Concept",
        "Theory"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypothetical-document-embedding",
      "term": "Hypothetical Document Embedding",
      "definition": "A retrieval technique (HyDE) where a language model generates a hypothetical answer to a query, and the embedding of that answer is used to search for real documents, improving retrieval relevance.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    }
  ]
}