{
  "letter": "h",
  "count": 130,
  "terms": [
    {
      "id": "term-h2o-danube",
      "term": "H2O Danube",
      "definition": "A family of compact language models from H2O.ai trained on high-quality data for efficient enterprise deployment in 1.8B and 3B parameter sizes.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-habana",
      "term": "Habana Labs",
      "definition": "An Intel subsidiary producing the Gaudi series of AI training accelerators featuring integrated RoCE networking and high memory bandwidth. Habana Gaudi processors offer a cost-effective alternative to NVIDIA GPUs for large-scale model training.",
      "tags": [
        "Hardware",
        "Distributed Computing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-habitat",
      "term": "Habitat",
      "definition": "A simulation platform for training embodied AI agents in photorealistic 3D environments. Enables research in visual navigation and interaction using scanned real-world spaces.",
      "tags": [
        "Benchmark",
        "Reinforcement Learning",
        "Robotics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hailo-8",
      "term": "Hailo-8",
      "definition": "AI inference processor designed by Israeli company Hailo delivering up to 26 TOPS at only 2.5 watts. Designed for edge AI in automotive surveillance and smart city applications.",
      "tags": [
        "Edge",
        "Accelerator",
        "Inference"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hallucination",
      "term": "Hallucination",
      "definition": "When AI generates information that sounds plausible but is actually incorrect or fabricated. Includes fake citations, invented statistics, and fictional events. A major challenge in LLM reliability.",
      "tags": [
        "Limitation",
        "Risk"
      ],
      "domain": "safety",
      "link": "../tools/hallucination.html",
      "related": []
    },
    {
      "id": "term-hallucination-mitigation",
      "term": "Hallucination Mitigation",
      "definition": "A collection of techniques designed to reduce factually incorrect or fabricated content in LLM outputs, including retrieval augmentation, self-consistency checks, and citation-based grounding.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hallucination-rate",
      "term": "Hallucination Rate",
      "definition": "A metric that quantifies the proportion of generated content that contains fabricated facts, unsupported claims, or information contradicting the source material, serving as a key safety and reliability indicator for language models.",
      "tags": [
        "Evaluation",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-halting-problem",
      "term": "Halting Problem",
      "definition": "A decision problem proved undecidable by Alan Turing in 1936. The halting problem asks whether a given program will eventually halt or run forever. Turing's proof established fundamental limits on what computers can compute influencing theoretical computer science and AI.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-halueval",
      "term": "HaluEval",
      "definition": "A benchmark for evaluating hallucination in large language models across QA dialogue and summarization tasks. Tests the ability to generate factually grounded responses.",
      "tags": [
        "Benchmark",
        "NLP",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hamiltonian-monte-carlo",
      "term": "Hamiltonian Monte Carlo",
      "definition": "An MCMC method that uses Hamiltonian dynamics to propose distant samples with high acceptance probability, reducing random walk behavior and improving exploration efficiency for high-dimensional distributions.",
      "tags": [
        "Statistics",
        "Bayesian Methods"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hamiltonian-path-problem",
      "term": "Hamiltonian Path Problem",
      "definition": "The problem of determining whether a path exists that visits every vertex in a graph exactly once. This is an NP-complete problem and no known polynomial-time algorithm exists for the general case.",
      "tags": [
        "Algorithms",
        "Technical",
        "Graph"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hamming-distance",
      "term": "Hamming Distance",
      "definition": "The number of positions at which corresponding symbols in two equal-length strings or vectors differ. It is used as a metric for comparing binary codes, error detection, and evaluating multi-label classification.",
      "tags": [
        "Machine Learning",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hand-pose-estimation",
      "term": "Hand Pose Estimation",
      "definition": "The task of predicting the 3D positions of hand joints and fingertips from images or depth sensors, enabling gesture recognition and hand tracking for VR/AR and sign language applications.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hans-moravec",
      "term": "Hans Moravec",
      "definition": "Austrian-Canadian roboticist at Carnegie Mellon University known for Moravec's Paradox and pioneering work in mobile robot navigation. His books Mind Children (1988) and Robot (1999) explored the future of artificial intelligence and robotics.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-attention",
      "term": "Hard Attention",
      "definition": "An attention mechanism that selects discrete positions to attend to rather than computing weighted averages, requiring reinforcement learning or straight-through estimators for training.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-disk-drive",
      "term": "Hard Disk Drive",
      "definition": "Electromechanical data storage device using rotating magnetic platters. While being replaced by SSDs for primary storage HDDs remain cost-effective for bulk AI data archival.",
      "tags": [
        "Storage",
        "Hardware",
        "Historical"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-sigmoid",
      "term": "Hard Sigmoid",
      "definition": "A piecewise linear approximation of the sigmoid function that is computationally cheaper to evaluate. Defined as f(x) = clip((x + 1) / 2 at 0 and 1). Used in mobile and embedded applications where computational efficiency is critical.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hard-swish",
      "term": "Hard Swish",
      "definition": "A piecewise linear approximation of the Swish activation function designed for efficient inference on mobile devices. Used in MobileNetV3 and defined as f(x) = x * hard_sigmoid(x). Balances accuracy and computational cost.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hardware-failure-recovery",
      "term": "Hardware Failure Recovery",
      "definition": "Mechanisms for detecting and recovering from hardware failures during AI training including GPU failures network issues and storage problems. Critical for multi-day training runs.",
      "tags": [
        "Reliability",
        "Infrastructure",
        "Training"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hardware-aware-neural-architecture-search",
      "term": "Hardware-Aware Neural Architecture Search",
      "definition": "NAS approach that incorporates hardware constraints like latency memory and power into the search objective. Produces models optimized for specific deployment hardware targets.",
      "tags": [
        "Training",
        "NAS",
        "Co-Design"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hardware-software-co-design",
      "term": "Hardware-Software Co-Design",
      "definition": "Design methodology where hardware and software are developed together to optimize overall system performance. Increasingly important for AI where custom hardware and specialized software must work in concert.",
      "tags": [
        "Design",
        "Methodology",
        "Optimization"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-harm-taxonomy",
      "term": "Harm Taxonomy",
      "definition": "A classification system for the types of harm that AI systems can cause. Categories typically include physical psychological financial reputational and societal harm with subcategories for specific risk types.",
      "tags": [
        "Safety",
        "Governance"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-harmony-search-algorithm",
      "term": "Harmony Search Algorithm",
      "definition": "An optimization algorithm inspired by the improvisation process of musicians seeking harmony. Each musician (variable) plays a note (value) that is adjusted based on memory and randomization to improve the overall harmony.",
      "tags": [
        "Algorithms",
        "Technical",
        "Metaheuristic"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-harris-corner-detection",
      "term": "Harris Corner Detection",
      "definition": "A corner detection algorithm that computes the eigenvalues of the structure tensor at each pixel to identify points where the image gradient changes significantly in multiple directions.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Vision"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-harvard-architecture",
      "term": "Harvard Architecture",
      "definition": "Computer architecture with separate memory and pathways for instructions and data. Used in some AI accelerators and DSPs to avoid the Von Neumann bottleneck.",
      "tags": [
        "Architecture",
        "Fundamentals",
        "Historical"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-harvard-mark-i",
      "term": "Harvard Mark I",
      "definition": "Electromechanical computer built by IBM for Harvard University completed in 1944. One of the first large-scale automatic digital computers used for World War II calculations.",
      "tags": [
        "Historical",
        "Computer",
        "IBM"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hate-speech-detection",
      "term": "Hate Speech Detection",
      "definition": "The task of automatically identifying text that expresses hatred toward a group based on attributes like race, gender, or religion, used in content moderation and online safety systems.",
      "tags": [
        "NLP",
        "Text Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hateful-memes",
      "term": "Hateful Memes",
      "definition": "A multimodal dataset from Facebook AI of 10000 memes annotated for hate speech. Tests the ability to understand hateful content that requires joint reasoning over image and text.",
      "tags": [
        "Benchmark",
        "Multimodal",
        "Safety"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hawk",
      "term": "Hawk",
      "definition": "A recurrent model architecture from Google DeepMind that uses a simple gated linear recurrence for efficient sequence modeling without attention mechanisms.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hazard-function",
      "term": "Hazard Function",
      "definition": "The instantaneous rate at which events occur for subjects who have survived up to a given time point. It is a fundamental quantity in survival analysis, describing how the risk of an event changes over time.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm2",
      "term": "HBM2",
      "definition": "Second generation High Bandwidth Memory stacking DRAM dies on a silicon interposer achieving up to 256 GB/s per stack. Used in data center GPUs like the Tesla V100.",
      "tags": [
        "Memory",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm2e",
      "term": "HBM2E",
      "definition": "Enhanced version of HBM2 memory achieving up to 460 GB/s bandwidth per stack with increased density. Used in GPUs like the AMD MI250X and NVIDIA A100.",
      "tags": [
        "Memory",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm3",
      "term": "HBM3",
      "definition": "Third generation High Bandwidth Memory specification achieving over 600 GB/s per stack with improved power efficiency. Featured in the NVIDIA H100 GPU.",
      "tags": [
        "Memory",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm3e",
      "term": "HBM3E",
      "definition": "Extended version of HBM3 memory pushing bandwidth above 1 TB/s per stack. Used in cutting-edge AI accelerators like the NVIDIA H200 for large language model workloads.",
      "tags": [
        "Memory",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hd-vila-100m",
      "term": "HD-VILA-100M",
      "definition": "A large-scale high-resolution video-language dataset containing 100 million video-text pairs. Provides diverse video data for pretraining video-language foundation models.",
      "tags": [
        "Training Corpus",
        "Video",
        "Multimodal"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hdbscan-algorithm",
      "term": "HDBSCAN Algorithm",
      "definition": "Hierarchical Density-Based Spatial Clustering extracts a cluster hierarchy from DBSCAN results and selects the most persistent clusters. Handles varying-density clusters and automatically determines the number of clusters.",
      "tags": [
        "Algorithms",
        "Technical",
        "Clustering"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-he-initialization",
      "term": "He Initialization",
      "definition": "A weight initialization strategy specifically designed for ReLU activation functions that scales the variance of initial weights by 2 divided by the number of input units.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-healthcare-ai-ethics",
      "term": "Healthcare AI Ethics",
      "definition": "Ethical considerations specific to AI in healthcare including patient autonomy informed consent clinical validation equitable access and the appropriate role of AI in medical decision-making.",
      "tags": [
        "Safety",
        "Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-heap-sort",
      "term": "Heap Sort",
      "definition": "A comparison-based sorting algorithm that uses a binary heap data structure. Builds a max-heap from the input and repeatedly extracts the maximum element to produce a sorted array. Guarantees O(n log n) time with O(1) extra space.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Sorting"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hearsay-ii",
      "term": "Hearsay-II",
      "definition": "A speech understanding system developed at Carnegie Mellon University in the 1970s. Notable for its blackboard architecture where multiple knowledge sources cooperated to interpret spoken language. Pioneered architectural concepts used in later multi-agent AI systems.",
      "tags": [
        "History",
        "Systems"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-heat-sink",
      "term": "Heat Sink",
      "definition": "Passive cooling device that absorbs and dissipates heat from processor chips through thermal conduction to fins with large surface area. Basic cooling component for CPUs and some GPUs.",
      "tags": [
        "Cooling",
        "Component",
        "Passive"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-heatmap-prediction",
      "term": "Heatmap Prediction",
      "definition": "A technique in keypoint detection that predicts a probability heatmap for each keypoint type, with peaks indicating likely keypoint locations, providing sub-pixel localization accuracy.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-heavy-light-decomposition",
      "term": "Heavy-Light Decomposition",
      "definition": "A technique that decomposes a tree into chains of heavy edges to enable efficient path queries. Allows answering path queries on trees in O(log^2 n) time using segment trees on each chain.",
      "tags": [
        "Algorithms",
        "Technical",
        "Graph"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hebbian-learning",
      "term": "Hebbian Learning",
      "definition": "A learning principle proposed by Donald Hebb in 1949 stating that neurons that fire together wire together, meaning synaptic connections strengthen when pre- and post-synaptic neurons are simultaneously active. This inspired neural network learning rules.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hedge-detection",
      "term": "Hedge Detection",
      "definition": "The task of identifying linguistic expressions that indicate uncertainty, speculation, or tentativeness in text, such as 'might,' 'possibly,' or 'it appears that.'",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hellaswag",
      "term": "HellaSwag",
      "definition": "A benchmark testing commonsense natural language inference. Models must select the most plausible continuation of a scenario, evaluating real-world reasoning capabilities.",
      "tags": [
        "Benchmark",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-helm",
      "term": "HELM",
      "definition": "The Holistic Evaluation of Language Models framework from Stanford CRFM. Evaluates language models across multiple scenarios and metrics including accuracy calibration robustness fairness and efficiency.",
      "tags": [
        "Benchmark",
        "NLP",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-herbert-gelernter",
      "term": "Herbert Gelernter",
      "definition": "American computer scientist who created the Geometry Theorem Prover in 1959 at IBM. The program could prove theorems in Euclidean geometry from axioms and represented an early success in automated reasoning and mathematical problem solving by computers.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-herbert-simon",
      "term": "Herbert Simon",
      "definition": "American political scientist, economist, and AI pioneer (1916-2001) who co-created the Logic Theorist and General Problem Solver, developed bounded rationality theory, and won the Nobel Prize in Economics in 1978.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hessian-locally-linear-embedding",
      "term": "Hessian Locally Linear Embedding",
      "definition": "An extension of locally linear embedding that uses the Hessian of the manifold to compute the embedding. Provides a theoretically justified embedding that recovers the true underlying parameterization.",
      "tags": [
        "Algorithms",
        "Technical",
        "Dimensionality Reduction"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-heterogeneous-computing",
      "term": "Heterogeneous Computing",
      "definition": "Computing approach using multiple types of processors such as CPUs GPUs and specialized accelerators to handle different workload characteristics efficiently.",
      "tags": [
        "Architecture",
        "Fundamentals",
        "Design"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-heteroscedasticity",
      "term": "Heteroscedasticity",
      "definition": "A condition in regression analysis where the variance of the residuals is not constant across all levels of the independent variables. It violates a key assumption of ordinary least squares and can bias standard error estimates.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-heuristic",
      "term": "Heuristic",
      "definition": "A practical rule or strategy that helps solve problems or make decisions quickly, even if not guaranteed to be optimal. Used in AI search, optimization, and rule-based systems.",
      "tags": [
        "Concept",
        "Problem Solving"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-heuristic-search",
      "term": "Heuristic Search",
      "definition": "A problem-solving approach that uses rules of thumb or estimates to guide search through a problem space more efficiently than exhaustive search. Herbert Simon popularized the term and A* search algorithm (1968) became a foundational heuristic search method in AI.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hgrn2",
      "term": "HGRN2",
      "definition": "Hierarchical Gated Recurrent Network version 2 uses state expansion and outer-product-based gating for efficient linear-time sequence modeling.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hi-fi-multi-speaker-english-tts",
      "term": "Hi-Fi Multi-Speaker English TTS",
      "definition": "A high-fidelity multi-speaker text-to-speech dataset containing 291.6 hours of speech from 10 speakers. Provides high-quality data for training neural TTS systems.",
      "tags": [
        "Training Corpus",
        "Speech"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-layer",
      "term": "Hidden Layer",
      "definition": "Layers in a neural network between the input and output layers. Deep networks have many hidden layers, enabling them to learn complex hierarchical representations.",
      "tags": [
        "Architecture",
        "Neural Networks"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-markov-model",
      "term": "Hidden Markov Model",
      "definition": "A statistical model where the system is assumed to be a Markov process with unobserved (hidden) states, and observations are probabilistically dependent on the hidden state. It is widely used in speech recognition and sequence labeling.",
      "tags": [
        "Machine Learning",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-markov-models",
      "term": "Hidden Markov Models",
      "definition": "Statistical models where the system being modeled is assumed to follow a Markov process with unobserved states. HMMs became fundamental to speech recognition in the 1970s and 1980s and were also applied to bioinformatics and natural language processing.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-hidden-technical-debt",
      "term": "Hidden Technical Debt",
      "definition": "The accumulated maintenance burden in machine learning systems that arises from entangled dependencies unstable data inputs and feedback loops. Identified by Sculley et al. at Google as a pervasive safety concern.",
      "tags": [
        "Safety",
        "Technical"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-hiera",
      "term": "Hiera",
      "definition": "A hierarchical vision Transformer from Meta that removes unnecessary architectural complexity by leveraging masked autoencoder pre-training for simplicity and speed.",
      "tags": [
        "Models",
        "Technical",
        "Vision"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hierarchical-clustering",
      "term": "Hierarchical Clustering",
      "definition": "A clustering approach that builds a tree-like hierarchy of clusters either by progressively merging smaller clusters (agglomerative) or by recursively splitting larger clusters (divisive), producing a dendrogram.",
      "tags": [
        "Machine Learning",
        "Clustering"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hierarchical-rl",
      "term": "Hierarchical Reinforcement Learning",
      "definition": "RL frameworks that decompose complex tasks into hierarchies of subtasks or skills operating at different temporal abstractions. Hierarchical RL enables efficient learning of long-horizon tasks through structured exploration.",
      "tags": [
        "Reinforcement Learning",
        "Multi-Agent"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hierarchical-storage-management",
      "term": "Hierarchical Storage Management",
      "definition": "Storage strategy that automatically migrates data between high-performance and low-cost storage tiers based on access patterns. Used in AI environments to manage datasets across SSDs and archival storage.",
      "tags": [
        "Storage",
        "Management",
        "Strategy"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hifi-gan",
      "term": "HiFi-GAN",
      "definition": "A generative adversarial network for high-fidelity speech synthesis that uses multi-period and multi-scale discriminators for audio waveform generation.",
      "tags": [
        "Models",
        "Technical",
        "Audio"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hbm",
      "term": "High Bandwidth Memory (HBM)",
      "definition": "A high-performance DRAM technology that stacks memory dies vertically and connects them with through-silicon vias, providing significantly higher bandwidth than traditional GDDR memory. HBM2e and HBM3 are standard in AI accelerators like the A100 and H100.",
      "tags": [
        "Hardware",
        "GPU"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-high-risk-ai-systems",
      "term": "High-Risk AI Systems",
      "definition": "Under the EU AI Act, AI systems used in critical domains such as biometric identification, critical infrastructure, education, employment, law enforcement, and migration that must meet stringent requirements.",
      "tags": [
        "Governance",
        "Regulation"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-high-stakes-ai",
      "term": "High-Stakes AI",
      "definition": "AI applications where errors can have severe consequences: healthcare diagnoses, legal decisions, financial transactions. Requires extra scrutiny, testing, and often human oversight.",
      "tags": [
        "Ethics",
        "Risk"
      ],
      "domain": "safety",
      "link": "ai-safety.html",
      "related": []
    },
    {
      "id": "term-hilbert-transform",
      "term": "Hilbert Transform",
      "definition": "A linear operator that computes the analytic signal by producing a 90-degree phase shift of the input signal. Used to compute the instantaneous amplitude and instantaneous frequency of a signal.",
      "tags": [
        "Algorithms",
        "Technical",
        "Signal Processing"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hill-climbing",
      "term": "Hill Climbing",
      "definition": "A local search optimization algorithm that iteratively moves toward higher-valued neighbors until no improvement is found. Simple and fast but easily trapped in local optima. Variants include stochastic and steepest-ascent hill climbing.",
      "tags": [
        "Algorithms",
        "Fundamentals"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hindsight-experience-replay",
      "term": "Hindsight Experience Replay (HER)",
      "definition": "A technique that augments failed trajectories by relabeling goals with actually achieved states, turning failures into successes for alternative goals. HER dramatically improves learning efficiency in goal-conditioned sparse reward environments.",
      "tags": [
        "Reinforcement Learning",
        "Training Paradigms"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hinge-loss",
      "term": "Hinge Loss",
      "definition": "A loss function used in maximum-margin classifiers such as SVMs, defined as max(0, 1 - y * f(x)). It penalizes predictions that are on the wrong side of the margin boundary.",
      "tags": [
        "Machine Learning",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-historical-bias",
      "term": "Historical Bias",
      "definition": "Bias that is encoded in data reflecting past discriminatory practices or societal inequalities, which AI systems can perpetuate even when the data accurately represents historical patterns.",
      "tags": [
        "Fairness",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-hit-rate",
      "term": "Hit Rate",
      "definition": "A retrieval metric that measures the fraction of queries for which at least one relevant document appears in the top K results, providing a simple binary assessment of retrieval success across a query set.",
      "tags": [
        "Evaluation",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hmdb-51",
      "term": "HMDB-51",
      "definition": "A dataset of 6849 video clips from 51 action categories collected from movies and web videos. Tests human motion recognition in realistic uncontrolled video conditions.",
      "tags": [
        "Benchmark",
        "Video"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hnsw",
      "term": "HNSW",
      "definition": "Hierarchical Navigable Small World, a graph-based approximate nearest neighbor algorithm that builds multi-layered proximity graphs with logarithmic search complexity, offering an excellent balance of search speed, accuracy, and memory usage for high-dimensional vector search.",
      "tags": [
        "Vector Database",
        "Index Structure"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hnsw-algorithm",
      "term": "HNSW Algorithm",
      "definition": "Hierarchical Navigable Small World graphs provide fast approximate nearest-neighbor search by building a multi-layer proximity graph. Queries traverse from coarse to fine layers using greedy search for efficient retrieval.",
      "tags": [
        "Algorithms",
        "Technical",
        "Searching",
        "Data Structure"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hoeffdings-inequality",
      "term": "Hoeffding's Inequality",
      "definition": "A probability inequality that provides an upper bound on the probability that the sum of bounded independent random variables deviates from its expected value. It is used to derive generalization bounds in learning theory.",
      "tags": [
        "Statistics",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hog-algorithm",
      "term": "HOG Algorithm",
      "definition": "Histogram of Oriented Gradients computes feature descriptors by counting gradient orientation occurrences in localized cells of an image. Originally developed for pedestrian detection and widely used in object recognition.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Vision"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-holdout-method",
      "term": "Holdout Method",
      "definition": "The simplest model evaluation strategy that splits data into separate training and test sets, typically using 70-80% for training and the remainder for testing. Results can vary depending on the random split.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-holt-winters-method",
      "term": "Holt-Winters Method",
      "definition": "A triple exponential smoothing method for time series forecasting that captures level, trend, and seasonal components. It supports both additive and multiplicative seasonal patterns.",
      "tags": [
        "Data Science",
        "Statistics"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-homography",
      "term": "Homography",
      "definition": "A projective transformation matrix that maps points between two image planes, used for image stitching, perspective correction, and augmented reality when the scene is planar or the camera undergoes pure rotation.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-homomorphic-encryption",
      "term": "Homomorphic Encryption",
      "definition": "A cryptographic technique that allows computations to be performed on encrypted data without decrypting it first, enabling AI models to process sensitive data while maintaining privacy guarantees.",
      "tags": [
        "Privacy",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-homomorphic-encryption-for-ml",
      "term": "Homomorphic Encryption for ML",
      "definition": "A cryptographic technique that enables computation on encrypted data without decryption. Allows machine learning inference and training to be performed on private data while maintaining confidentiality throughout.",
      "tags": [
        "Algorithms",
        "Technical",
        "Privacy"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-homonymy",
      "term": "Homonymy",
      "definition": "The property of two or more words having the same spelling or pronunciation but unrelated meanings, such as 'bat' the animal and 'bat' the sporting equipment.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hopcroft-karp-algorithm",
      "term": "Hopcroft-Karp Algorithm",
      "definition": "An algorithm for finding maximum cardinality matching in bipartite graphs. Uses alternating BFS and DFS phases to find augmenting paths and runs in O(E * sqrt(V)) time.",
      "tags": [
        "Algorithms",
        "Technical",
        "Graph"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hopfield-network",
      "term": "Hopfield Network",
      "definition": "A recurrent neural network with symmetric connections that stores patterns as energy minima, functioning as an associative memory that retrieves stored patterns from partial or noisy inputs.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-horn-schunck-optical-flow",
      "term": "Horn-Schunck Optical Flow",
      "definition": "A global method for computing dense optical flow that adds a smoothness constraint to the brightness constancy assumption. Produces flow vectors for every pixel by solving a variational optimization problem.",
      "tags": [
        "Algorithms",
        "Technical",
        "Vision"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-horovod",
      "term": "Horovod",
      "definition": "Uber open-source distributed deep learning training framework that simplifies multi-GPU and multi-node training. Uses ring allreduce for efficient gradient synchronization.",
      "tags": [
        "Distributed Training",
        "Open Source",
        "Framework"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hot-aisle-cold-aisle",
      "term": "Hot Aisle Cold Aisle",
      "definition": "Data center airflow management strategy that arranges server racks to create alternating hot and cold aisles. Improves cooling efficiency by preventing hot and cold air from mixing.",
      "tags": [
        "Cooling",
        "Data Center",
        "Design"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hotpotqa",
      "term": "HotpotQA",
      "definition": "A question answering dataset requiring multi-hop reasoning across multiple Wikipedia paragraphs. Contains 113000 questions that cannot be answered from a single passage alone.",
      "tags": [
        "Benchmark",
        "NLP",
        "Reasoning"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hough-transform",
      "term": "Hough Transform",
      "definition": "A feature extraction technique that detects shapes (lines and circles and other parametric curves) in images by mapping edge points to a parameter space and finding accumulation peaks.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Vision"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-householder-transformation",
      "term": "Householder Transformation",
      "definition": "A linear algebra operation that reflects a vector about a hyperplane. Used in QR decomposition and tridiagonalization of symmetric matrices and is numerically more stable than Gram-Schmidt orthogonalization.",
      "tags": [
        "Algorithms",
        "Technical",
        "Numerical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-how2",
      "term": "How2",
      "definition": "A multimodal dataset of 80000 instructional videos with English subtitles and Portuguese translations. Used for multimodal machine translation and video summarization research.",
      "tags": [
        "Training Corpus",
        "Video",
        "Multimodal",
        "Translation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hpd",
      "term": "HPD",
      "definition": "Human Preference Dataset for image generation containing human preference judgments between pairs of generated images. Used for aligning image generation models with human aesthetics.",
      "tags": [
        "Training Corpus",
        "Multimodal",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hpl-mxp",
      "term": "HPL-MxP",
      "definition": "Mixed-precision LINPACK benchmark measuring performance using lower precision formats typical of AI workloads. Better reflects real-world AI hardware capabilities than traditional LINPACK.",
      "tags": [
        "Benchmark",
        "Performance",
        "AI"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-huawei-ascend",
      "term": "Huawei Ascend",
      "definition": "Huawei AI accelerator chip family based on the Da Vinci architecture covering edge to cloud AI workloads. The Ascend 910 targets large-scale AI training in Chinese data centers.",
      "tags": [
        "Accelerator",
        "China",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-huber-loss",
      "term": "Huber Loss",
      "definition": "A loss function that is quadratic for small residuals and linear for large residuals, combining the best properties of mean squared error and mean absolute error. It is more robust to outliers than squared error loss.",
      "tags": [
        "Machine Learning",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hubert",
      "term": "HuBERT",
      "definition": "Hidden-Unit BERT is a self-supervised speech representation model that learns from masked prediction of discrete hidden units derived from clustering. Achieves strong performance on speech recognition and spoken language understanding tasks.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hubert-dreyfus",
      "term": "Hubert Dreyfus",
      "definition": "American philosopher who was one of the earliest critics of artificial intelligence. His 1972 book What Computers Can't Do argued that AI based on symbolic processing could not replicate human intelligence which relies on intuition embodiment and social context.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-huffman-coding-algorithm",
      "term": "Huffman Coding Algorithm",
      "definition": "A lossless data compression algorithm that assigns variable-length codes to symbols based on their frequencies. More frequent symbols receive shorter codes and the resulting code is provably optimal among prefix codes.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Information Theory",
        "History"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hugging-face",
      "term": "Hugging Face",
      "definition": "A platform and community for sharing AI models, datasets, and applications. Hosts thousands of open-source models and the popular Transformers library for NLP.",
      "tags": [
        "Platform",
        "Open Source"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hugging-face-datasets-library",
      "term": "Hugging Face Datasets Library",
      "definition": "A library for easily accessing and sharing datasets with efficient data loading and processing. Provides a unified API for thousands of NLP vision and audio datasets.",
      "tags": [
        "Platform",
        "General"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hugging-face-hub",
      "term": "Hugging Face Hub",
      "definition": "A platform hosting over 200000 machine learning models datasets and demo applications. The largest open repository for sharing and discovering ML resources.",
      "tags": [
        "Platform",
        "NLP",
        "Computer Vision"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-dignity-in-ai",
      "term": "Human Dignity in AI",
      "definition": "The principle that AI systems should respect the inherent worth and rights of all human beings. Serves as a foundational value in many AI ethics frameworks and human rights-based approaches to AI governance.",
      "tags": [
        "Safety",
        "Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-evaluation",
      "term": "Human Evaluation",
      "definition": "The gold standard for assessing language model outputs where human annotators rate or compare generated text on dimensions such as quality, accuracy, helpfulness, and harmlessness, providing ground truth for validating automated metrics.",
      "tags": [
        "Evaluation",
        "Methodology"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-factors-in-ai-safety",
      "term": "Human Factors in AI Safety",
      "definition": "The study of how human cognitive abilities limitations and behaviors interact with AI systems to affect safety outcomes. Includes interface design alert fatigue and decision-making under uncertainty.",
      "tags": [
        "Safety",
        "Technical"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-mesh-recovery",
      "term": "Human Mesh Recovery",
      "definition": "The task of estimating a full 3D human body mesh (shape and pose) from a single 2D image, using parametric body models like SMPL to represent body geometry.",
      "tags": [
        "Computer Vision",
        "3D Vision"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-oversight",
      "term": "Human Oversight",
      "definition": "The requirement that human beings maintain meaningful control over AI system decisions particularly in high-stakes applications. A cornerstone principle of responsible AI governance and regulatory frameworks.",
      "tags": [
        "Safety",
        "Fundamentals"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-human-rights-impact-assessment-for-ai",
      "term": "Human Rights Impact Assessment for AI",
      "definition": "A structured evaluation of how an AI system may affect internationally recognized human rights including privacy non-discrimination and freedom of expression.",
      "tags": [
        "Safety",
        "Governance"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-hitl",
      "term": "Human-in-the-Loop (HITL)",
      "definition": "A design approach where humans review, approve, or modify AI outputs before they're acted upon. Critical for high-stakes decisions, quality control, and maintaining accountability.",
      "tags": [
        "Practice",
        "Safety"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-humaneval",
      "term": "HumanEval",
      "definition": "A benchmark for evaluating code generation capabilities of LLMs. Contains programming problems with test cases, measuring how often generated code passes all tests.",
      "tags": [
        "Benchmark",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-humanitys-last-exam",
      "term": "Humanity's Last Exam",
      "definition": "A benchmark of extremely challenging expert-level questions crowdsourced from academics and professionals. Designed to test the upper limits of AI knowledge and reasoning.",
      "tags": [
        "Benchmark",
        "NLP",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-hungarian-algorithm",
      "term": "Hungarian Algorithm",
      "definition": "An optimization algorithm that solves the assignment problem in polynomial time by finding a minimum-cost matching in a weighted bipartite graph. Runs in O(n^3) time and is also known as the Kuhn-Munkres algorithm.",
      "tags": [
        "Algorithms",
        "Technical",
        "Graph",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hunyuandit",
      "term": "HunyuanDiT",
      "definition": "A text-to-image diffusion Transformer from Tencent that supports both Chinese and English text prompts with fine-grained understanding of bilingual instructions.",
      "tags": [
        "Models",
        "Technical",
        "Vision",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-ai",
      "term": "Hybrid AI",
      "definition": "Systems combining multiple AI approaches: neural networks with symbolic reasoning, LLMs with search, or ML with rule-based logic. Often more robust than pure approaches.",
      "tags": [
        "Architecture",
        "Design"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-retrieval",
      "term": "Hybrid Retrieval",
      "definition": "An information retrieval approach that combines sparse retrieval methods like BM25 with dense retrieval using neural embeddings. Leverages the strengths of both exact term matching and semantic similarity for improved recall and precision.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hybrid-search",
      "term": "Hybrid Search",
      "definition": "A retrieval approach that combines dense vector similarity search with traditional keyword-based (sparse) retrieval, leveraging the strengths of both methods for more robust document matching.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyena",
      "term": "Hyena",
      "definition": "A subquadratic attention replacement that uses long convolutions parameterized by implicit neural representations and multiplicative gating to achieve competitive performance with transformers at lower cost.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyena-hierarchy",
      "term": "Hyena Hierarchy",
      "definition": "A sub-quadratic attention replacement that uses long convolutions and gating to achieve Transformer-quality performance with linear scaling in sequence length.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyper-sd",
      "term": "Hyper-SD",
      "definition": "A framework for generating images in one to eight steps using human feedback-driven trajectory segmentation for unified low-step diffusion models.",
      "tags": [
        "Models",
        "Technical",
        "Vision"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperband",
      "term": "Hyperband",
      "definition": "A hyperparameter optimization method that combines random search with early stopping, allocating more resources to promising configurations by successively halving the number of candidates and doubling the budget for survivors.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperloglog-algorithm",
      "term": "HyperLogLog Algorithm",
      "definition": "A probabilistic cardinality estimation algorithm that counts the number of distinct elements in a multiset using logarithmic memory. Achieves approximately 2% standard error using only about 12 kilobytes of memory.",
      "tags": [
        "Algorithms",
        "Technical",
        "Data Structure"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypernymy",
      "term": "Hypernymy",
      "definition": "A semantic relation where one word's meaning includes and is more general than another's, such as 'animal' being a hypernym of 'dog,' forming taxonomic hierarchies in lexical databases.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperparameter",
      "term": "Hyperparameter",
      "definition": "Configuration settings that control the training process rather than being learned from data. Examples include learning rate, batch size, number of layers, and dropout rate.",
      "tags": [
        "Training",
        "Configuration"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperparameter-optimization",
      "term": "Hyperparameter Optimization",
      "definition": "The process of finding optimal hyperparameter configurations for machine learning models. Methods include grid search random search Bayesian optimization and evolutionary approaches. Critical for model performance in practice.",
      "tags": [
        "Algorithms",
        "Fundamentals"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyperscale-data-center",
      "term": "Hyperscale Data Center",
      "definition": "Massive computing facility with tens of thousands of servers designed for cloud computing and AI workloads. Operated by companies like Google Microsoft Amazon and Meta for AI training at scale.",
      "tags": [
        "Data Center",
        "Infrastructure"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-hyponymy",
      "term": "Hyponymy",
      "definition": "A semantic relation where one word's meaning is more specific than and included within another's, such as 'dog' being a hyponym of 'animal,' representing an is-a relationship.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypothesis",
      "term": "Hypothesis (ML)",
      "definition": "A specific function or model that the learning algorithm considers as a possible solution. The hypothesis space is all possible hypotheses the algorithm can choose from.",
      "tags": [
        "Concept",
        "Theory"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-hypothetical-document-embedding",
      "term": "Hypothetical Document Embedding",
      "definition": "A retrieval technique (HyDE) where a language model generates a hypothetical answer to a query, and the embedding of that answer is used to search for real documents, improving retrieval relevance.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    }
  ]
}