{
  "letter": "j",
  "count": 32,
  "terms": [
    {
      "id": "term-jaccard-index",
      "term": "Jaccard Index",
      "definition": "A similarity coefficient measuring the overlap between two sets, defined as the size of their intersection divided by the size of their union. It ranges from 0 (no overlap) to 1 (identical sets).",
      "tags": [
        "Machine Learning",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-jaccard-similarity",
      "term": "Jaccard Similarity",
      "definition": "A set-based similarity metric calculated as the size of the intersection divided by the size of the union of two sets, commonly applied to binary vectors or token sets to measure overlap between document representations.",
      "tags": [
        "Vector Database",
        "Similarity"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-jackknife",
      "term": "Jackknife",
      "definition": "A resampling method that systematically leaves out one observation at a time and recomputes the statistic, using the variation across leave-one-out estimates to assess bias and variance of the estimator.",
      "tags": [
        "Statistics",
        "Inference"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-jacobian-vector-product",
      "term": "Jacobian-Vector Product",
      "definition": "An efficient computation that multiplies the Jacobian matrix of a function by a vector without explicitly forming the full Jacobian. Used in forward-mode automatic differentiation and various second-order optimization methods.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-jailbreak",
      "term": "Jailbreak",
      "definition": "Attempts to bypass an AI system's safety restrictions through cleverly crafted prompts. A ongoing challenge for AI developers in maintaining safe behavior.",
      "tags": [
        "Security",
        "Risk"
      ],
      "domain": "safety",
      "link": "ai-safety.html",
      "related": []
    },
    {
      "id": "term-jamba",
      "term": "Jamba",
      "definition": "A hybrid architecture by AI21 Labs that interleaves transformer and Mamba layers with mixture-of-experts. Combines the strengths of attention and state space models for improved efficiency and performance.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-james-slagle",
      "term": "James Slagle",
      "definition": "American computer scientist who developed SAINT (Symbolic Automatic INTegrator) in 1961 at MIT. SAINT could solve symbolic integration problems demonstrating that computers could perform mathematical reasoning tasks previously thought to require human intelligence.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-japanese-fifth-generation-project",
      "term": "Japanese Fifth Generation Computer Project",
      "definition": "A 1982-1992 Japanese government initiative to develop massively parallel computers using logic programming for AI applications. Its perceived failure contributed to the second AI winter and reduced global AI investment.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-jax",
      "term": "JAX",
      "definition": "Google's library for high-performance numerical computing and automatic differentiation. Popular for ML research due to its composability and GPU/TPU support.",
      "tags": [
        "Framework",
        "Technical"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-jax-framework",
      "term": "JAX Framework",
      "definition": "Google's numerical computing framework that combines NumPy-like syntax with automatic differentiation, XLA compilation, and native support for SPMD parallelism across TPU and GPU clusters. JAX enables functional-style ML programming with high performance.",
      "tags": [
        "Distributed Computing",
        "Model Optimization"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-jeff-dean",
      "term": "Jeff Dean",
      "definition": "American computer scientist and head of Google AI who co-developed foundational large-scale systems including MapReduce TensorFlow and the Transformer architecture team at Google. Instrumental in scaling deep learning from research to production systems.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-jeffreys-prior",
      "term": "Jeffreys Prior",
      "definition": "A non-informative prior distribution derived from the Fisher information matrix that is invariant under reparametrization. It provides a principled default prior when no prior knowledge is available.",
      "tags": [
        "Statistics",
        "Bayesian Methods"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-jensen-shannon-divergence",
      "term": "Jensen-Shannon Divergence",
      "definition": "A symmetric and bounded divergence measure derived from KL divergence, computed as the average KL divergence of two distributions from their mixture. It is always finite and ranges from 0 to log(2).",
      "tags": [
        "Statistics",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-backus",
      "term": "John Backus",
      "definition": "American computer scientist who led the development of FORTRAN the first widely used high-level programming language at IBM in the 1950s. His 1977 Turing Award lecture advocated for functional programming which influenced AI programming paradigms.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-holland",
      "term": "John Holland",
      "definition": "American computer scientist (1929-2015) who invented genetic algorithms and developed the Holland schema theorem, founding the field of evolutionary computation and demonstrating how adaptation could be computationally modeled.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-hopfield",
      "term": "John Hopfield",
      "definition": "American physicist who introduced Hopfield networks in 1982, applying concepts from statistical physics to create neural network models for associative memory. He shared the 2024 Nobel Prize in Physics with Geoffrey Hinton.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-mccarthy",
      "term": "John McCarthy",
      "definition": "American computer scientist (1927-2011) who coined the term artificial intelligence in 1955, organized the Dartmouth Workshop, invented the LISP programming language, and pioneered time-sharing and formal reasoning systems.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-searle",
      "term": "John Searle",
      "definition": "American philosopher who proposed the Chinese Room argument in 1980, challenging the notion that computers can truly understand language or possess minds, distinguishing between strong AI and weak AI.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-john-von-neumann",
      "term": "John von Neumann",
      "definition": "Hungarian-American mathematician (1903-1957) who made foundational contributions to computer architecture, game theory, and cellular automata, and whose stored-program concept enabled the general-purpose computers necessary for AI.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-joseph-weizenbaum",
      "term": "Joseph Weizenbaum",
      "definition": "German-American computer scientist (1923-2008) who created ELIZA and later became a prominent critic of AI, warning about the ethical implications of machines simulating human interaction in his book Computer Power and Human Reason.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-joshua-lederberg",
      "term": "Joshua Lederberg",
      "definition": "American molecular biologist and Nobel laureate who collaborated with Edward Feigenbaum on DENDRAL. Lederberg saw the potential for computers to assist scientific discovery and his interdisciplinary approach helped bridge the gap between AI and natural sciences.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-joy-buolamwini",
      "term": "Joy Buolamwini",
      "definition": "Ghanaian-American computer scientist who founded the Algorithmic Justice League. Her research at MIT Media Lab exposed significant racial and gender bias in facial recognition systems leading to improved accuracy standards and policy discussions about AI fairness.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-json",
      "term": "JSON (JavaScript Object Notation)",
      "definition": "A structured data format commonly used for API responses and structured output from LLMs. Many AI models can generate valid JSON when requested.",
      "tags": [
        "Format",
        "Technical"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-json-mode-generation",
      "term": "JSON Mode",
      "definition": "An inference configuration that constrains a language model to produce only valid JSON output, typically implemented through grammar-based token masking or fine-tuning on JSON-formatted data.",
      "tags": [
        "Generative AI",
        "LLM"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-json-mode-prompting",
      "term": "JSON Mode Prompting",
      "definition": "A prompting technique that instructs the language model to output responses exclusively in valid JSON format, often combined with schema definitions and API-level JSON mode enforcement to ensure machine-readable structured responses.",
      "tags": [
        "Prompt Engineering",
        "Output Format"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-judea-pearl",
      "term": "Judea Pearl",
      "definition": "Israeli-American computer scientist who pioneered Bayesian networks and causal inference in AI, receiving the 2011 Turing Award for his work on probabilistic and causal reasoning frameworks.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-juergen-schmidhuber",
      "term": "Juergen Schmidhuber",
      "definition": "German computer scientist who co-invented Long Short-Term Memory (LSTM) networks with Sepp Hochreiter in 1997. Pioneer in recurrent neural networks reinforcement learning and artificial curiosity. His work at IDSIA in Switzerland advanced sequence modeling.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-jupyter",
      "term": "Jupyter Notebook",
      "definition": "An interactive computing environment where code, visualizations, and text can be combined. Widely used for data science, ML experimentation, and educational content.",
      "tags": [
        "Tools",
        "Development"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-jurassic",
      "term": "Jurassic",
      "definition": "A family of large language models developed by AI21 Labs. Jurassic-2 features a custom tokenizer optimized for efficiency and supports multiple languages. Available through the AI21 Studio API.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-jurgen-schmidhuber",
      "term": "Jurgen Schmidhuber",
      "definition": "German-Swiss computer scientist who co-invented LSTM networks, contributed to recurrent neural network research, and advocated for recognition of early neural network pioneers in the history of deep learning.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-just-transition-for-ai",
      "term": "Just Transition for AI",
      "definition": "Policies and practices to ensure that the benefits and costs of AI-driven economic transformation are distributed equitably particularly for workers and communities most affected by automation.",
      "tags": [
        "Safety",
        "Policy"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-justice-in-ai",
      "term": "Justice in AI",
      "definition": "The application of principles of distributive procedural and restorative justice to the development and deployment of AI systems. Ensures fair allocation of benefits and burdens across society.",
      "tags": [
        "Safety",
        "Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    }
  ]
}