{
  "letter": "o",
  "count": 68,
  "terms": [
    {
      "id": "term-o1",
      "term": "o1",
      "definition": "An OpenAI reasoning model that uses chain-of-thought processing to solve complex problems. Spends additional compute time thinking through problems before responding. Excels at math coding and scientific reasoning tasks.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-o3",
      "term": "o3",
      "definition": "An advanced reasoning model from OpenAI that extends o1 capabilities with improved performance on challenging benchmarks. Demonstrates stronger reasoning across mathematics coding and scientific domains.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-object-tracking",
      "term": "Object Tracking",
      "definition": "The task of following one or more objects across video frames by maintaining consistent identity assignments, using methods that combine detection, appearance features, and motion prediction.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-observation-normalization",
      "term": "Observation Normalization",
      "definition": "The technique of normalizing input observations to zero mean and unit variance using running statistics, improving neural network training stability. Observation normalization is a standard preprocessing step in continuous control RL tasks.",
      "tags": [
        "Reinforcement Learning",
        "Core Concepts"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-observation-space",
      "term": "Observation Space",
      "definition": "The specification of the format and bounds of observations that an RL agent receives from the environment, including data type, shape, and valid ranges. Observation spaces can be discrete, continuous, or structured (e.g., dictionaries, images).",
      "tags": [
        "Reinforcement Learning",
        "Core Concepts"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-observational-fairness",
      "term": "Observational Fairness",
      "definition": "A fairness criterion that can be evaluated using observed data without requiring causal models. Includes statistical parity equalized odds and predictive parity as testable conditions.",
      "tags": [
        "Safety",
        "Technical"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-occams-razor",
      "term": "Occam's Razor",
      "definition": "A principle favoring simpler models over more complex ones when both explain the data equally well. In machine learning, it motivates regularization and model selection criteria that penalize complexity.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-occams-razor-in-ml",
      "term": "Occam's Razor in ML",
      "definition": "The application of the principle of parsimony to machine learning: simpler models that explain the data well are preferred over complex ones. This principle underlies regularization techniques model selection criteria and the bias-variance tradeoff.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-occupancy-network",
      "term": "Occupancy Network",
      "definition": "A neural network that predicts whether each point in 3D space is occupied or empty, representing 3D shapes as continuous implicit functions rather than discrete voxels or meshes.",
      "tags": [
        "Computer Vision",
        "3D Vision"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-oecd-ai-principles",
      "term": "OECD AI Principles",
      "definition": "Principles adopted by OECD member countries in 2019 promoting AI that is innovative, trustworthy, and respects human rights, including recommendations on transparency, robustness, accountability, and inclusive growth.",
      "tags": [
        "Governance",
        "Regulation"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-offensive-language-detection",
      "term": "Offensive Language Detection",
      "definition": "The task of classifying text as offensive, abusive, or inappropriate, distinguishing between targeted insults, profanity, and general offensive content for content moderation.",
      "tags": [
        "NLP",
        "Text Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-offline-rl",
      "term": "Offline Reinforcement Learning",
      "definition": "An RL paradigm that learns policies entirely from a fixed dataset of previously collected experience without further environment interaction. Offline RL addresses distributional shift through conservative value estimation or policy constraints.",
      "tags": [
        "Reinforcement Learning",
        "Training Paradigms"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-offloading",
      "term": "Offloading (CPU/Disk)",
      "definition": "A technique that stores model parameters, optimizer states, or activations in CPU RAM or disk when GPU memory is insufficient, transferring them back when needed. Offloading enables working with models larger than GPU memory at the cost of increased latency.",
      "tags": [
        "Model Optimization",
        "Distributed Computing"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-oliver-selfridge",
      "term": "Oliver Selfridge",
      "definition": "American computer scientist (1926-2008) who created the Pandemonium model for pattern recognition in 1959 and made early contributions to machine learning, often called the father of machine perception.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-ollama",
      "term": "Ollama",
      "definition": "A tool for running LLMs locally on personal computers. Simplifies downloading and running open-source models like Llama, enabling private, offline AI use.",
      "tags": [
        "Tools",
        "Local AI"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-on-policy-vs-off-policy",
      "term": "On-Policy vs Off-Policy",
      "definition": "A distinction between RL methods that learn about the policy currently being executed (on-policy, e.g., SARSA) and those that learn about a different target policy using data from a behavior policy (off-policy, e.g., Q-learning). Off-policy methods enable experience replay and greater data efficiency.",
      "tags": [
        "Reinforcement Learning",
        "Core Concepts"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-one-class-svm",
      "term": "One-Class SVM",
      "definition": "A variant of support vector machines for anomaly detection that learns a decision boundary enclosing the normal data. Maps data to a high-dimensional feature space and finds the hyperplane with maximum margin from the origin.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-one-cycle-policy",
      "term": "One-Cycle Policy",
      "definition": "A learning rate schedule that uses a single cycle of increasing then decreasing learning rate combined with inverse momentum scheduling. Proposed by Smith and Topin in 2018 as super-convergence enabling training with very high learning rates.",
      "tags": [
        "Algorithms",
        "Training"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-one-hot-encoding",
      "term": "One-Hot Encoding",
      "definition": "A feature encoding technique that converts each categorical value into a binary vector with a single 1 at the position corresponding to that category and 0s elsewhere, creating one new binary feature per category.",
      "tags": [
        "Machine Learning",
        "Feature Engineering"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-one-shot",
      "term": "One-Shot Learning",
      "definition": "Providing a single example in your prompt to demonstrate the desired output format or style. Falls between zero-shot (no examples) and few-shot (multiple examples).",
      "tags": [
        "Prompting",
        "Technique"
      ],
      "domain": "general",
      "link": "../learn/index.html",
      "related": []
    },
    {
      "id": "term-one-vs-rest-classification",
      "term": "One-Vs-Rest Classification",
      "definition": "A strategy for extending binary classifiers to multi-class problems by training one classifier per class, treating that class as positive and all others as negative. Predictions use the classifier with the highest confidence.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-online-learning",
      "term": "Online Learning",
      "definition": "A learning paradigm where the model is updated incrementally as each new data point arrives, rather than being trained on a fixed batch. It is suitable for streaming data and environments where the data distribution changes.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-online-learning-algorithm",
      "term": "Online Learning Algorithm",
      "definition": "A learning paradigm where the model updates incrementally as new data arrives one example at a time. Suitable for streaming data and non-stationary environments. Algorithms include online gradient descent and online convex optimization.",
      "tags": [
        "Algorithms",
        "Training"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-onnx",
      "term": "ONNX (Open Neural Network Exchange)",
      "definition": "An open format for representing ML models, enabling interoperability between different frameworks. Allows models trained in PyTorch to run in TensorFlow, etc.",
      "tags": [
        "Format",
        "Interoperability"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-onnx-runtime",
      "term": "ONNX Runtime",
      "definition": "Microsoft's cross-platform inference engine that executes models in the Open Neural Network Exchange format with hardware-specific optimizations. ONNX Runtime supports graph optimizations, quantization, and execution providers for CPUs, GPUs, and specialized accelerators.",
      "tags": [
        "Inference Infrastructure",
        "Model Optimization"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-ontology-in-ai",
      "term": "Ontology in AI",
      "definition": "A formal representation of knowledge as a set of concepts within a domain and the relationships between those concepts. AI ontologies like Cyc and the Gene Ontology provide structured vocabularies that enable knowledge sharing and reasoning across AI systems.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-open-source",
      "term": "Open Source / Open Weight",
      "definition": "AI models with publicly available weights that can be downloaded and run locally. Ranges from fully open (Llama) to restricted licenses. Enables customization and transparency.",
      "tags": [
        "Licensing",
        "Access"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-open-source-ai-movement",
      "term": "Open Source AI Movement",
      "definition": "The growing trend of releasing AI model weights and training code publicly, enabling broader research and development while sparking debates about safety, dual-use risks, and the democratization of powerful AI capabilities.",
      "tags": [
        "History",
        "Governance"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-open-domain-qa",
      "term": "Open-Domain Question Answering",
      "definition": "A QA setting where the model must answer questions using a large corpus or parametric knowledge without being given a specific context passage, often combining retrieval with reading.",
      "tags": [
        "NLP",
        "Text Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-open-source-ai-safety",
      "term": "Open-Source AI Safety",
      "definition": "Safety considerations specific to AI models and tools released as open source. Includes the tension between democratizing access for beneficial uses and enabling misuse by removing access controls.",
      "tags": [
        "Safety",
        "Policy"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-open-vocabulary-detection",
      "term": "Open-Vocabulary Detection",
      "definition": "Object detection approaches that can identify and localize objects from categories not seen during training, leveraging vision-language models to generalize beyond fixed class vocabularies.",
      "tags": [
        "Computer Vision",
        "Object Detection"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-openai",
      "term": "OpenAI",
      "definition": "The AI research company behind GPT models, ChatGPT, and DALL-E. Founded in 2015, it has been central to the development and popularization of modern AI assistants.",
      "tags": [
        "Company",
        "LLM Provider"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-openai-founded",
      "term": "OpenAI Founded",
      "definition": "The founding of OpenAI as a nonprofit AI research laboratory in December 2015 by Sam Altman Elon Musk and others with the mission of ensuring that artificial general intelligence benefits all of humanity. OpenAI later developed the GPT series and ChatGPT.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-openai-founding",
      "term": "OpenAI Founding",
      "definition": "The founding of OpenAI in December 2015 as a non-profit AI research laboratory by Sam Altman, Elon Musk, and others, with the mission of ensuring artificial general intelligence benefits all of humanity.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-openai-capped-profit",
      "term": "OpenAI Transition to Capped Profit",
      "definition": "OpenAI's 2019 restructuring from a non-profit to a capped-profit company to attract the capital needed for large-scale AI research, creating a hybrid governance structure that later became controversial.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-openpose",
      "term": "OpenPose",
      "definition": "A real-time multi-person pose estimation system that uses part affinity fields and confidence maps to detect body, hand, facial, and foot keypoints in images with multiple people.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-operationalizing-ethics",
      "term": "Operationalizing Ethics",
      "definition": "The process of translating abstract ethical principles into concrete actionable requirements for AI system design development and deployment. Bridges the gap between ethical theory and engineering practice.",
      "tags": [
        "Safety",
        "Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-operator-fusion",
      "term": "Operator Fusion",
      "definition": "A compiler optimization that combines multiple sequential neural network operations into a single kernel launch, reducing memory I/O and kernel launch overhead. Operator fusion is a key optimization in TensorRT, XLA, and other ML compilers.",
      "tags": [
        "Inference Infrastructure",
        "Model Optimization"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-opponent-modeling",
      "term": "Opponent Modeling",
      "definition": "The practice of explicitly modeling the behavior, goals, or strategy of other agents in a multi-agent environment. Opponent models enable more effective adaptation and strategic reasoning in competitive and mixed-motive settings.",
      "tags": [
        "Reinforcement Learning",
        "Multi-Agent"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-ops5",
      "term": "OPS5",
      "definition": "A rule-based programming language developed at Carnegie Mellon University in the late 1970s. OPS5 was used to implement the R1/XCON expert system and became one of the most influential production system languages in the expert systems era.",
      "tags": [
        "History",
        "Systems"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-opt",
      "term": "OPT",
      "definition": "Open Pre-trained Transformer is a family of decoder-only language models released by Meta AI ranging from 125M to 175B parameters. Released with full model weights and training code to promote open research on large language models.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-optical-character-recognition",
      "term": "Optical Character Recognition",
      "definition": "The technology that converts images of text (handwritten, printed, or typed) into machine-readable text, using detection to localize text regions and recognition to identify individual characters or words.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-optical-flow",
      "term": "Optical Flow",
      "definition": "The estimation of per-pixel motion vectors between consecutive video frames, representing the apparent movement of objects or camera, used in video analysis, stabilization, and action recognition.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-optical-flow-estimation",
      "term": "Optical Flow Estimation",
      "definition": "The computational process of predicting dense pixel-level displacement fields between consecutive video frames using deep learning models like RAFT or FlowNet that learn motion patterns.",
      "tags": [
        "Computer Vision",
        "Image Processing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-optics",
      "term": "OPTICS",
      "definition": "Ordering Points To Identify the Clustering Structure is a density-based clustering algorithm that creates an ordering of points reflecting their density connectivity. Unlike DBSCAN it can identify clusters with varying densities without a global density threshold.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-optimization",
      "term": "Optimization",
      "definition": "The process of adjusting model parameters to minimize loss. Includes algorithms (Adam, SGD), learning rate schedules, and techniques for finding good solutions efficiently.",
      "tags": [
        "Training",
        "Process"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-option-framework",
      "term": "Option Framework",
      "definition": "A formalism for temporal abstraction in RL where options are temporally extended actions consisting of an initiation set, an internal policy, and a termination condition. Options enable hierarchical decision-making at multiple time scales.",
      "tags": [
        "Reinforcement Learning",
        "Core Concepts"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-oracle",
      "term": "Oracle (ML)",
      "definition": "A theoretical perfect model or information source used as a benchmark. In evaluation, comparing to an oracle helps understand the ceiling of achievable performance.",
      "tags": [
        "Concept",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-orca",
      "term": "Orca",
      "definition": "A language model by Microsoft that learns from rich signals including explanation traces from GPT-4. Demonstrates that smaller models can achieve strong reasoning when trained on detailed step-by-step explanations.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-ordinal-regression",
      "term": "Ordinal Regression",
      "definition": "A type of regression analysis for predicting ordinal (ordered categorical) outcomes. It models the cumulative probabilities of the ordered categories using a link function and threshold parameters.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-oriol-vinyals",
      "term": "Oriol Vinyals",
      "definition": "Spanish computer scientist at DeepMind known for sequence-to-sequence learning pointer networks and leading the AlphaStar project that achieved Grandmaster level in StarCraft II. His work has advanced both natural language processing and game-playing AI.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-orpo",
      "term": "ORPO",
      "definition": "Odds Ratio Preference Optimization, an alignment method that combines supervised fine-tuning and preference alignment in a single training stage by using odds ratios to distinguish preferred from rejected responses.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-orthogonal-initialization",
      "term": "Orthogonal Initialization",
      "definition": "A weight initialization technique that initializes weight matrices as random orthogonal matrices. Helps preserve gradient norms during forward and backward propagation. Particularly beneficial for recurrent neural networks.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-orthogonality-thesis",
      "term": "Orthogonality Thesis",
      "definition": "The philosophical claim that intelligence and goals are orthogonal, meaning that any level of intelligence can in principle be combined with any terminal goal, implying that a superintelligent AI need not be benevolent.",
      "tags": [
        "AI Safety",
        "Alignment"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-out-of-bag-error",
      "term": "Out-of-Bag Error",
      "definition": "An estimate of prediction error for bagged models computed using observations not included in the bootstrap sample for each base learner. It provides an unbiased estimate without the need for a separate validation set.",
      "tags": [
        "Machine Learning",
        "Metrics"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-out-of-distribution",
      "term": "Out-of-Distribution (OOD)",
      "definition": "Data that differs significantly from what a model was trained on. Models often perform poorly on OOD data, making detection important for reliable deployment.",
      "tags": [
        "Challenge",
        "Robustness"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-out-of-vocabulary",
      "term": "Out-of-Vocabulary",
      "definition": "Words or tokens encountered during inference that were not present in the model's training vocabulary, requiring special handling through subword tokenization, character-level models, or UNK tokens.",
      "tags": [
        "NLP",
        "Tokenization"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-outcome-fairness",
      "term": "Outcome Fairness",
      "definition": "A fairness assessment that evaluates whether the real-world outcomes of AI system decisions are equitable across different demographic groups rather than just the predictions themselves.",
      "tags": [
        "Safety",
        "Technical"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-outcome-reward-model",
      "term": "Outcome Reward Model",
      "definition": "A reward model that evaluates only the final output of a generation, providing a holistic quality score used in RLHF to train the policy model toward producing better end results.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-outer-alignment",
      "term": "Outer Alignment",
      "definition": "The problem of ensuring that the base objective or loss function used during training accurately captures the intended goal of the system designer. Even a perfectly optimized misspecified objective leads to undesired behavior.",
      "tags": [
        "AI Safety",
        "Alignment"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-outlier-detection",
      "term": "Outlier Detection",
      "definition": "The process of identifying data points that differ significantly from the majority of observations. Methods include statistical tests (Z-score, IQR), distance-based approaches, and model-based techniques.",
      "tags": [
        "Data Science",
        "Statistics"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-outpainting",
      "term": "Outpainting",
      "definition": "The task of extending an image beyond its original boundaries by generating new coherent content that seamlessly continues the existing visual context in any direction.",
      "tags": [
        "Generative AI",
        "Image Processing"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-output-layer",
      "term": "Output Layer",
      "definition": "The final layer of a neural network that produces the model's predictions. Its design depends on the task: softmax for classification, linear for regression.",
      "tags": [
        "Architecture",
        "Neural Networks"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-overestimation-bias",
      "term": "Overestimation Bias",
      "definition": "A systematic tendency of Q-learning and related algorithms to overestimate action values due to the max operator in the Bellman optimality equation. Overestimation bias is addressed by methods like double Q-learning and clipped double Q-learning.",
      "tags": [
        "Reinforcement Learning",
        "Value Methods"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-overfitting",
      "term": "Overfitting",
      "definition": "When a model performs well on training data but poorly on new data, having memorized specific examples rather than learning general patterns. Addressed through regularization and validation.",
      "tags": [
        "Problem",
        "Training"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-oversight-mechanism",
      "term": "Oversight Mechanism",
      "definition": "Any process tool or institution designed to monitor and control AI system behavior. Includes technical monitoring human review regulatory inspection and public accountability mechanisms.",
      "tags": [
        "Safety",
        "Governance"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-owl-vit",
      "term": "OWL-ViT",
      "definition": "Open-World Localization with Vision Transformer is a zero-shot object detection model that localizes objects from text queries. Uses CLIP-style contrastive pretraining adapted for detection with a simple architecture.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-ownership-of-ai-generated-content",
      "term": "Ownership of AI-Generated Content",
      "definition": "Legal and ethical questions about who owns content created by AI systems. Involves debates about copyright intellectual property rights and the role of human creativity in AI-assisted creation.",
      "tags": [
        "Safety",
        "Policy"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    }
  ]
}