{
  "letter": "q",
  "count": 17,
  "terms": [
    {
      "id": "term-q-function",
      "term": "Q-Function",
      "definition": "The action-value function Q(s,a) that estimates the expected cumulative reward of taking action a in state s and then following a given policy. Q-functions enable agents to compare the desirability of different actions.",
      "tags": [
        "Reinforcement Learning",
        "Value Methods"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-q-learning",
      "term": "Q-Learning",
      "definition": "An off-policy temporal difference algorithm that learns the optimal action-value function Q* by iteratively updating Q-values using the Bellman optimality equation. It converges to the optimal policy regardless of the behavior policy.",
      "tags": [
        "Reinforcement Learning",
        "Value Methods"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qdrant",
      "term": "Qdrant",
      "definition": "An open-source vector similarity search engine written in Rust that provides filtering, payload storage, and distributed deployment capabilities, designed for high-performance production workloads with advanced quantization and indexing options.",
      "tags": [
        "Vector Database",
        "Open Source"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qlora",
      "term": "QLoRA (Quantized LoRA)",
      "definition": "A technique combining quantization with LoRA fine-tuning. Enables fine-tuning large models on consumer GPUs by using 4-bit quantized base models.",
      "tags": [
        "Training",
        "Efficiency"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qmix",
      "term": "QMIX",
      "definition": "A multi-agent RL algorithm that factorizes the joint action-value function as a monotonic combination of per-agent utilities through a mixing network. QMIX enables centralized training with decentralized execution in cooperative settings.",
      "tags": [
        "Reinforcement Learning",
        "Multi-Agent"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qr-decomposition",
      "term": "QR Decomposition",
      "definition": "A matrix factorization that expresses a matrix as the product of an orthogonal matrix Q and an upper triangular matrix R. Used in solving least squares problems computing eigenvalues and stabilizing numerical computations.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-qualcomm-ai-engine",
      "term": "Qualcomm AI Engine",
      "definition": "Qualcomm's heterogeneous AI compute platform that coordinates the Hexagon DSP, Adreno GPU, and Kryo CPU within Snapdragon processors for optimal AI inference. The AI Engine dispatches neural network operations to the most efficient processing unit.",
      "tags": [
        "Hardware",
        "Inference Infrastructure"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-qualitative-reasoning",
      "term": "Qualitative Reasoning",
      "definition": "An approach to modeling and reasoning about continuous systems using qualitative rather than numerical descriptions. Developed by researchers including Benjamin Kuipers and Kenneth Forbus in the 1980s it enables reasoning about physical systems without precise quantitative data.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantile-regression",
      "term": "Quantile Regression",
      "definition": "A regression method that estimates conditional quantiles (such as the median or 90th percentile) of the response variable rather than the conditional mean, providing a more complete picture of the response distribution.",
      "tags": [
        "Statistics",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantile-quantile-plot",
      "term": "Quantile-Quantile Plot",
      "definition": "A graphical tool for comparing two probability distributions by plotting their quantiles against each other. It is commonly used to assess whether a dataset follows a theoretical distribution such as the normal.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantization",
      "term": "Quantization",
      "definition": "Reducing the precision of model weights (e.g., from 16-bit to 4-bit) to decrease memory usage and increase speed. Enables running larger models on limited hardware.",
      "tags": [
        "Optimization",
        "Deployment"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantization-aware-training",
      "term": "Quantization-Aware Training (QAT)",
      "definition": "A training technique that simulates the effects of quantization during the forward pass while maintaining full-precision gradients for backpropagation. QAT produces models that are more robust to quantization than post-training methods.",
      "tags": [
        "Model Optimization",
        "Inference Infrastructure"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-query",
      "term": "Query",
      "definition": "In RAG/search: the user's question or search terms. In attention: one of three vectors (query, key, value) used to compute attention weights.",
      "tags": [
        "Concept",
        "Dual Meaning"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-query-decomposition",
      "term": "Query Decomposition",
      "definition": "A retrieval strategy that breaks a complex multi-faceted query into simpler sub-queries, retrieves results for each independently, and merges the results to address questions that require information from multiple documents or perspectives.",
      "tags": [
        "Retrieval",
        "Query Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-query-expansion",
      "term": "Query Expansion",
      "definition": "A retrieval technique that augments the original query with additional related terms, synonyms, or reformulations to improve recall by bridging vocabulary gaps between the user's query and relevant documents in the index.",
      "tags": [
        "Retrieval",
        "Query Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-question-answering",
      "term": "Question Answering (QA)",
      "definition": "An NLP task where the model answers questions based on provided context or its knowledge. Includes extractive QA (finding answers in text) and generative QA (generating answers).",
      "tags": [
        "NLP Task",
        "Application"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen",
      "term": "Qwen",
      "definition": "A family of large language models developed by Alibaba Cloud. Available in multiple sizes with strong multilingual capabilities particularly for Chinese and English. Includes specialized code and math variants.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    }
  ]
}