{
  "letter": "q",
  "count": 43,
  "terms": [
    {
      "id": "term-q-function",
      "term": "Q-Function",
      "definition": "The action-value function Q(s,a) that estimates the expected cumulative reward of taking action a in state s and then following a given policy. Q-functions enable agents to compare the desirability of different actions.",
      "tags": [
        "Reinforcement Learning",
        "Value Methods"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-q-learning",
      "term": "Q-Learning",
      "definition": "An off-policy temporal difference algorithm that learns the optimal action-value function Q* by iteratively updating Q-values using the Bellman optimality equation. It converges to the optimal policy regardless of the behavior policy.",
      "tags": [
        "Reinforcement Learning",
        "Value Methods"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qasper",
      "term": "Qasper",
      "definition": "A question answering dataset based on NLP research papers where questions are written by NLP practitioners. Tests the ability to answer questions from long scientific documents.",
      "tags": [
        "Benchmark",
        "NLP",
        "Scientific"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-qdrant",
      "term": "Qdrant",
      "definition": "An open-source vector similarity search engine written in Rust that provides filtering, payload storage, and distributed deployment capabilities, designed for high-performance production workloads with advanced quantization and indexing options.",
      "tags": [
        "Vector Database",
        "Open Source"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qlora",
      "term": "QLoRA (Quantized LoRA)",
      "definition": "A technique combining quantization with LoRA fine-tuning. Enables fine-tuning large models on consumer GPUs by using 4-bit quantized base models.",
      "tags": [
        "Training",
        "Efficiency"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qm9",
      "term": "QM9",
      "definition": "A dataset of 134000 small organic molecules with quantum chemical properties computed using density functional theory. Standard benchmark for molecular property prediction models.",
      "tags": [
        "Benchmark",
        "Scientific"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-qmix",
      "term": "QMIX",
      "definition": "A multi-agent RL algorithm that factorizes the joint action-value function as a monotonic combination of per-agent utilities through a mixing network. QMIX enables centralized training with decentralized execution in cooperative settings.",
      "tags": [
        "Reinforcement Learning",
        "Multi-Agent"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-qmix-algorithm",
      "term": "QMIX Algorithm",
      "definition": "A multi-agent reinforcement learning method that factorizes the joint action-value function into per-agent utilities combined through a monotonic mixing network. Enables decentralized execution with centralized training.",
      "tags": [
        "Algorithms",
        "Technical",
        "RL"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-qnli",
      "term": "QNLI",
      "definition": "Question Natural Language Inference a dataset derived from the Stanford Question Answering Dataset converted into sentence pair classification. Tests whether a context sentence contains the answer.",
      "tags": [
        "Benchmark",
        "NLP"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-qqp",
      "term": "QQP",
      "definition": "Quora Question Pairs a dataset of over 400000 question pairs from Quora annotated for semantic equivalence. Tests the ability to determine whether two questions have the same meaning.",
      "tags": [
        "Benchmark",
        "NLP"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-qr-algorithm",
      "term": "QR Algorithm",
      "definition": "An iterative eigenvalue algorithm that repeatedly computes the QR decomposition of a matrix and reforms it as RQ. Converges to a triangular or quasi-triangular form revealing all eigenvalues. The standard method for dense eigenvalue problems.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Numerical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-qr-decomposition",
      "term": "QR Decomposition",
      "definition": "A matrix factorization that expresses a matrix as the product of an orthogonal matrix Q and an upper triangular matrix R. Used in solving least squares problems computing eigenvalues and stabilizing numerical computations.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quac",
      "term": "QuAC",
      "definition": "Question Answering in Context a dataset of 14000 information-seeking dialogues about Wikipedia sections. Models must answer questions in the context of a conversation with incomplete information.",
      "tags": [
        "Benchmark",
        "NLP"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-quadtree-algorithm",
      "term": "Quadtree Algorithm",
      "definition": "A tree data structure that partitions a two-dimensional space by recursively subdividing it into four quadrants. Used for spatial indexing and image compression and collision detection in computational geometry.",
      "tags": [
        "Algorithms",
        "Technical",
        "Data Structure"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-qualcomm-ai-engine",
      "term": "Qualcomm AI Engine",
      "definition": "Qualcomm's heterogeneous AI compute platform that coordinates the Hexagon DSP, Adreno GPU, and Kryo CPU within Snapdragon processors for optimal AI inference. The AI Engine dispatches neural network operations to the most efficient processing unit.",
      "tags": [
        "Hardware",
        "Inference Infrastructure"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-qualcomm-snapdragon-8-gen-3",
      "term": "Qualcomm Snapdragon 8 Gen 3",
      "definition": "Qualcomm flagship mobile processor featuring the Hexagon NPU capable of 45 TOPS for on-device AI inference. Powers Android smartphones with integrated generative AI capabilities.",
      "tags": [
        "Mobile",
        "Qualcomm",
        "SoC"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-qualitative-reasoning",
      "term": "Qualitative Reasoning",
      "definition": "An approach to modeling and reasoning about continuous systems using qualitative rather than numerical descriptions. Developed by researchers including Benjamin Kuipers and Kenneth Forbus in the 1980s it enables reasoning about physical systems without precise quantitative data.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-quality",
      "term": "QuALITY",
      "definition": "A question answering benchmark requiring reading and understanding of long documents averaging 5000 words. Tests long-context comprehension with multiple-choice questions.",
      "tags": [
        "Benchmark",
        "NLP"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantile-regression",
      "term": "Quantile Regression",
      "definition": "A regression method that estimates conditional quantiles (such as the median or 90th percentile) of the response variable rather than the conditional mean, providing a more complete picture of the response distribution.",
      "tags": [
        "Statistics",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantile-quantile-plot",
      "term": "Quantile-Quantile Plot",
      "definition": "A graphical tool for comparing two probability distributions by plotting their quantiles against each other. It is commonly used to assess whether a dataset follows a theoretical distribution such as the normal.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantization",
      "term": "Quantization",
      "definition": "Reducing the precision of model weights (e.g., from 16-bit to 4-bit) to decrease memory usage and increase speed. Enables running larger models on limited hardware.",
      "tags": [
        "Optimization",
        "Deployment"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantization-aware-training",
      "term": "Quantization-Aware Training (QAT)",
      "definition": "A training technique that simulates the effects of quantization during the forward pass while maintaining full-precision gradients for backpropagation. QAT produces models that are more robust to quantization than post-training methods.",
      "tags": [
        "Model Optimization",
        "Inference Infrastructure"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-annealing",
      "term": "Quantum Annealing",
      "definition": "Quantum computing approach that finds low-energy states of optimization problems by exploiting quantum tunneling. D-Wave systems use quantum annealing rather than gate-based quantum computing.",
      "tags": [
        "Quantum",
        "Optimization",
        "Approach"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-computing-for-ai",
      "term": "Quantum Computing for AI",
      "definition": "Application of quantum mechanical phenomena to accelerate certain AI computations. Quantum computers may eventually solve optimization and sampling problems exponentially faster than classical hardware.",
      "tags": [
        "Emerging",
        "Quantum",
        "Computing"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-error-correction",
      "term": "Quantum Error Correction",
      "definition": "Techniques for protecting quantum information from decoherence and noise using redundant qubits. Essential for building fault-tolerant quantum computers capable of running complex AI algorithms.",
      "tags": [
        "Quantum",
        "Reliability",
        "Fundamentals"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-gate",
      "term": "Quantum Gate",
      "definition": "Basic quantum operation that manipulates one or more qubits analogous to logic gates in classical computing. Sequences of quantum gates implement quantum algorithms.",
      "tags": [
        "Quantum",
        "Fundamentals",
        "Operation"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-supremacy",
      "term": "Quantum Supremacy",
      "definition": "Milestone where a quantum computer solves a specific problem faster than any classical supercomputer. Google claimed quantum supremacy in 2019 with its Sycamore processor.",
      "tags": [
        "Quantum",
        "Milestone",
        "Benchmark"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-quantum-volume",
      "term": "Quantum Volume",
      "definition": "Metric for measuring the computational capability of quantum computers accounting for qubits connectivity and error rates. Provides a more holistic measure than qubit count alone.",
      "tags": [
        "Quantum",
        "Metric",
        "Benchmark"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-qubit",
      "term": "Qubit",
      "definition": "Fundamental unit of quantum information that can exist in superposition of 0 and 1 states simultaneously. Quantum computers use qubits to explore many computational paths in parallel.",
      "tags": [
        "Quantum",
        "Fundamentals"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-query",
      "term": "Query",
      "definition": "In RAG/search: the user's question or search terms. In attention: one of three vectors (query, key, value) used to compute attention weights.",
      "tags": [
        "Concept",
        "Dual Meaning"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-query-decomposition",
      "term": "Query Decomposition",
      "definition": "A retrieval strategy that breaks a complex multi-faceted query into simpler sub-queries, retrieves results for each independently, and merges the results to address questions that require information from multiple documents or perspectives.",
      "tags": [
        "Retrieval",
        "Query Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-query-expansion",
      "term": "Query Expansion",
      "definition": "A retrieval technique that augments the original query with additional related terms, synonyms, or reformulations to improve recall by bridging vocabulary gaps between the user's query and relevant documents in the index.",
      "tags": [
        "Retrieval",
        "Query Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-question-answering",
      "term": "Question Answering (QA)",
      "definition": "An NLP task where the model answers questions based on provided context or its knowledge. Includes extractive QA (finding answers in text) and generative QA (generating answers).",
      "tags": [
        "NLP Task",
        "Application"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-quick-sort",
      "term": "Quick Sort",
      "definition": "A divide-and-conquer sorting algorithm that selects a pivot element and partitions the array around it. Has O(n log n) average time complexity but O(n^2) worst case. Typically the fastest general-purpose in-memory sorting algorithm in practice.",
      "tags": [
        "Algorithms",
        "Fundamentals",
        "Sorting"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-quotient-filter-algorithm",
      "term": "Quotient Filter Algorithm",
      "definition": "A space-efficient probabilistic data structure similar to a Bloom filter that supports membership queries and deletions. Stores fingerprints in a compact hash table with linear probing for overflow.",
      "tags": [
        "Algorithms",
        "Technical",
        "Data Structure"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen",
      "term": "Qwen",
      "definition": "A family of large language models developed by Alibaba Cloud. Available in multiple sizes with strong multilingual capabilities particularly for Chinese and English. Includes specialized code and math variants.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen-15",
      "term": "Qwen 1.5",
      "definition": "An improved version of Alibaba's Qwen language model series with enhanced multilingual capabilities and instruction-following across multiple parameter sizes.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen-2",
      "term": "Qwen 2",
      "definition": "A second-generation large language model family from Alibaba featuring models from 0.5B to 72B parameters with strong multilingual and coding performance.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen-25",
      "term": "Qwen 2.5",
      "definition": "A third-generation language model family from Alibaba with improved instruction following and mathematical reasoning across sizes from 0.5B to 72B parameters.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen-audio",
      "term": "Qwen-Audio",
      "definition": "An audio-language model from Alibaba that can understand and reason about diverse audio inputs including speech and music and environmental sounds.",
      "tags": [
        "Models",
        "Technical",
        "NLP",
        "Audio"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen-vl",
      "term": "Qwen-VL",
      "definition": "A vision-language model from Alibaba that extends Qwen with visual perception capabilities for image understanding and multimodal dialogue.",
      "tags": [
        "Models",
        "Technical",
        "NLP",
        "Vision"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen2-audio",
      "term": "Qwen2-Audio",
      "definition": "A second-generation audio-language model from Alibaba with enhanced capabilities for understanding and reasoning about diverse audio inputs in conversations.",
      "tags": [
        "Models",
        "Technical",
        "Audio",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-qwen25-coder",
      "term": "Qwen2.5-Coder",
      "definition": "A code-specialized model from the Qwen 2.5 family with improved multi-language code generation and stronger reasoning about programming concepts.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    }
  ]
}