{
  "letter": "u",
  "count": 29,
  "terms": [
    {
      "id": "term-u-net",
      "term": "U-Net",
      "definition": "A fully convolutional encoder-decoder architecture with skip connections between corresponding encoder and decoder layers, originally designed for biomedical image segmentation.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-umap",
      "term": "UMAP",
      "definition": "Uniform Manifold Approximation and Projection, a nonlinear dimensionality reduction method that constructs a topological representation of high-dimensional data and optimizes a low-dimensional embedding to preserve its structure. It is faster than t-SNE and better preserves global structure.",
      "tags": [
        "Machine Learning",
        "Dimensionality Reduction"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-uncanny-valley",
      "term": "Uncanny Valley",
      "definition": "A concept introduced by roboticist Masahiro Mori in 1970 describing the dip in human comfort when encountering robots or animations that closely but imperfectly resemble humans. The uncanny valley has implications for the design of humanoid robots and virtual characters.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-underfitting",
      "term": "Underfitting",
      "definition": "When a model is too simple to capture patterns in the data, performing poorly on both training and test data. Addressed by increasing model capacity or training longer.",
      "tags": [
        "Problem",
        "Training"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-undersampling",
      "term": "Undersampling",
      "definition": "A strategy for addressing class imbalance by randomly removing examples from the majority class to create a more balanced training set, potentially at the cost of losing useful information.",
      "tags": [
        "Machine Learning",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-unesco-ai-ethics-recommendation",
      "term": "UNESCO AI Ethics Recommendation",
      "definition": "The first global standard on AI ethics, adopted by UNESCO member states in 2021, providing a comprehensive framework covering values, principles, and policy areas for ethical AI governance.",
      "tags": [
        "Governance",
        "Regulation"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-unet-diffusion",
      "term": "UNet Diffusion",
      "definition": "The U-Net backbone commonly used in diffusion models as the denoising network, incorporating timestep conditioning, cross-attention for text conditioning, and skip connections for multi-scale feature preservation.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-unification-algorithm",
      "term": "Unification Algorithm",
      "definition": "A fundamental algorithm in logic and computer science that finds a substitution making two terms identical. Essential to Prolog and automated theorem proving unification was formalized by John Alan Robinson in 1965 as part of his resolution principle.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-unified-io",
      "term": "Unified-IO",
      "definition": "A model that unifies diverse vision and language tasks in a single architecture using a sequence-to-sequence framework. Handles image generation segmentation visual question answering and region captioning with shared parameters.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-uniform-distribution",
      "term": "Uniform Distribution",
      "definition": "A probability distribution where all outcomes in a given range are equally likely. The continuous version has constant density over an interval, while the discrete version assigns equal probability to each value.",
      "tags": [
        "Statistics",
        "Probability"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-unigram-language-model-tokenizer",
      "term": "Unigram Language Model Tokenizer",
      "definition": "A subword tokenization method that starts with a large vocabulary and iteratively removes tokens that least affect the overall likelihood. Unlike BPE which builds up vocabulary this approach prunes down. Used in SentencePiece.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-unigram-tokenization",
      "term": "Unigram Tokenization",
      "definition": "A subword tokenization method that starts with a large vocabulary and iteratively removes tokens whose loss has the least impact on the overall corpus likelihood, using a unigram language model.",
      "tags": [
        "NLP",
        "Tokenization"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-unigram-tokenizer",
      "term": "Unigram Tokenizer",
      "definition": "A subword tokenization algorithm that starts with a large vocabulary and iteratively removes tokens to minimize the overall loss on the training corpus, finding an optimal compact vocabulary.",
      "tags": [
        "LLM",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-unimate",
      "term": "Unimate",
      "definition": "The first industrial robot installed on a General Motors assembly line in 1961. Developed by George Devol and Joseph Engelberger Unimate performed tasks like die casting and spot welding marking the beginning of industrial robotics.",
      "tags": [
        "History",
        "Systems"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-uninformative-prior",
      "term": "Uninformative Prior",
      "definition": "A prior distribution that expresses minimal information about the parameter before observing data, such as a uniform distribution over the parameter space, allowing the data to dominate the posterior.",
      "tags": [
        "Statistics",
        "Bayesian Methods"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-unintended-consequences-of-ai",
      "term": "Unintended Consequences of AI",
      "definition": "Outcomes of AI deployment that were not anticipated or intended by developers. Arise from complex interactions between AI systems and social environments and highlight the limits of prediction in sociotechnical systems.",
      "tags": [
        "Safety",
        "Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-universal-approximation-theorem",
      "term": "Universal Approximation Theorem",
      "definition": "A theorem proving that feedforward neural networks with a single hidden layer containing a finite number of neurons can approximate any continuous function on compact subsets of R^n. First proved by George Cybenko in 1989 for sigmoid networks.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-universal-basic-income-and-ai",
      "term": "Universal Basic Income and AI",
      "definition": "Proposals for unconditional periodic cash payments to all citizens, discussed as a potential policy response to widespread job displacement caused by AI and automation technologies.",
      "tags": [
        "AI Ethics",
        "Governance"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-universal-dependencies",
      "term": "Universal Dependencies",
      "definition": "A cross-linguistically consistent framework for annotating grammar including parts of speech, morphological features, and syntactic dependencies, enabling multilingual NLP model development.",
      "tags": [
        "NLP",
        "Linguistics"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-universal-sentence-encoder",
      "term": "Universal Sentence Encoder",
      "definition": "A model that encodes text into high-dimensional vectors for transfer learning across NLP tasks. Available in transformer and deep averaging network variants. Produces fixed-size sentence embeddings useful for semantic similarity.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-universal-turing-machine",
      "term": "Universal Turing Machine",
      "definition": "A Turing machine that can simulate any other Turing machine given a description of that machine on its tape. Proposed by Alan Turing in 1936 the concept anticipated stored-program computers and established that a single machine could be programmed for any computable task.",
      "tags": [
        "History",
        "Fundamentals"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-unstructured-pruning",
      "term": "Unstructured Pruning",
      "definition": "A pruning approach that removes individual weights regardless of their position in the weight matrix, resulting in sparse matrices. Unstructured pruning achieves higher compression ratios but requires sparse matrix hardware or software support for speedup.",
      "tags": [
        "Model Optimization",
        "Inference Infrastructure"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-unsupervised-environment-design",
      "term": "Unsupervised Environment Design",
      "definition": "A framework where a teacher agent or mechanism automatically generates training environments at the frontier of the student agent's capabilities. Methods like PAIRED and PLR create adaptive curricula that maximize learning progress.",
      "tags": [
        "Reinforcement Learning",
        "Training Paradigms"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-unsupervised-learning",
      "term": "Unsupervised Learning",
      "definition": "Machine learning from unlabeled data, discovering patterns without explicit guidance. Includes clustering, dimensionality reduction, and self-supervised pre-training of LLMs.",
      "tags": [
        "Learning Type",
        "Fundamentals"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-upper-confidence-bound",
      "term": "Upper Confidence Bound",
      "definition": "A family of bandit algorithms that select the action with the highest upper confidence bound on its expected reward, combining the estimated reward with an exploration bonus that decreases as the action is sampled more.",
      "tags": [
        "Machine Learning",
        "Optimization"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-upsampling",
      "term": "Upsampling",
      "definition": "Increasing resolution or quantity of data. In image AI, upscaling low-res images. In training, duplicating underrepresented examples to balance datasets.",
      "tags": [
        "Technique",
        "Data"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-use-case",
      "term": "Use Case",
      "definition": "A specific application or scenario where AI provides value. Understanding your use case helps choose the right model, prompting strategy, and safety measures.",
      "tags": [
        "Concept",
        "Application"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-user-prompt",
      "term": "User Prompt",
      "definition": "The input provided by the user in a conversation, as opposed to the system prompt set by developers. Together with system prompts, they form the complete context for AI responses.",
      "tags": [
        "Prompting",
        "Concept"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-utility-function",
      "term": "Utility Function",
      "definition": "A mathematical function that measures how \"good\" an outcome is. In AI alignment, designing utility functions that capture human values is a fundamental challenge.",
      "tags": [
        "Concept",
        "Alignment"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    }
  ]
}