{
  "letter": "x",
  "count": 31,
  "terms": [
    {
      "id": "term-x-clip",
      "term": "X-CLIP",
      "definition": "A cross-modal contrastive learning model that extends CLIP to video understanding by incorporating temporal information through multi-frame visual encoding.",
      "tags": [
        "Models",
        "Technical",
        "Vision",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-x-means-algorithm",
      "term": "X-Means Algorithm",
      "definition": "An extension of k-means that automatically determines the optimal number of clusters. Recursively splits clusters and uses the Bayesian information criterion to decide whether each split improves the model.",
      "tags": [
        "Algorithms",
        "Technical",
        "Clustering"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-x-risk",
      "term": "X-Risk",
      "definition": "Shorthand for existential risk, referring to catastrophic scenarios that could result in human extinction or permanent civilizational collapse. AI is considered one of several potential sources of x-risk.",
      "tags": [
        "AI Safety",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-x86-architecture",
      "term": "x86 Architecture",
      "definition": "Intel and AMD dominant instruction set architecture for desktop and server processors. While CISC-based modern x86 chips internally translate to RISC-like micro-operations.",
      "tags": [
        "Architecture",
        "Intel",
        "AMD"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xai-company",
      "term": "xAI",
      "definition": "Elon Musk's AI company, creator of the Grok chatbot. Founded in 2023, it aims to develop AI that can understand the universe and has access to real-time X (Twitter) data.",
      "tags": [
        "Company",
        "LLM Provider"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xai",
      "term": "XAI (Explainable AI)",
      "definition": "The field focused on making AI decisions understandable to humans. Includes techniques for visualizing attention, attributing outputs to inputs, and generating explanations.",
      "tags": [
        "Field",
        "Transparency"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-xavier-initialization",
      "term": "Xavier Initialization",
      "definition": "A weight initialization method that samples weights from a distribution scaled by the number of input and output neurons, designed to maintain activation variance across layers with sigmoid or tanh activations.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xcopa",
      "term": "XCOPA",
      "definition": "Cross-lingual Choice of Plausible Alternatives a benchmark for cross-lingual commonsense reasoning in 11 languages. Translates the COPA causal reasoning task across typologically diverse languages.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual",
        "Reasoning"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xerox-alto",
      "term": "Xerox Alto",
      "definition": "Pioneering personal computer developed at Xerox PARC in 1973 featuring a graphical user interface mouse and Ethernet. Influenced the development of the Apple Macintosh and modern computing.",
      "tags": [
        "Historical",
        "Computer",
        "Pioneer"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xgboost",
      "term": "XGBoost",
      "definition": "An optimized implementation of gradient boosting that uses regularized objectives, column subsampling, and efficient tree construction algorithms. It includes built-in handling of missing values and parallel processing.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xgboost-model",
      "term": "XGBoost Model",
      "definition": "An optimized gradient boosting framework that uses regularization and parallel processing and cache-aware computation for fast and accurate tree ensemble learning.",
      "tags": [
        "Models",
        "Fundamentals"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xglue",
      "term": "XGLUE",
      "definition": "A cross-lingual benchmark covering 11 tasks in 19 languages for evaluating multilingual pretrained models on both understanding and generation tasks.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xilinx-alveo",
      "term": "Xilinx Alveo",
      "definition": "AMD (formerly Xilinx) FPGA accelerator cards designed for data center workloads including AI inference. Offers reconfigurable hardware that can be optimized for specific neural network architectures.",
      "tags": [
        "FPGA",
        "AMD",
        "Data Center"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xla-accelerated-linear-algebra",
      "term": "XLA (Accelerated Linear Algebra)",
      "definition": "Google compiler for linear algebra operations that optimizes computation graphs for TPUs GPUs and CPUs. Used by TensorFlow and JAX to generate efficient hardware-specific code.",
      "tags": [
        "Compiler",
        "Google",
        "Optimization"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xla-compiler",
      "term": "XLA Compiler",
      "definition": "Accelerated Linear Algebra, a domain-specific compiler for machine learning that optimizes computation graphs through operator fusion, memory layout optimization, and hardware-specific code generation. XLA is used by JAX and TensorFlow for GPU and TPU compilation.",
      "tags": [
        "Inference Infrastructure",
        "Model Optimization"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xlm-roberta",
      "term": "XLM-RoBERTa",
      "definition": "A cross-lingual language model pre-trained on 2.5 terabytes of filtered CommonCrawl data in 100 languages for multilingual understanding tasks.",
      "tags": [
        "Models",
        "Technical",
        "NLP",
        "Fundamentals"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xlnet",
      "term": "XLNet",
      "definition": "A generalized autoregressive pretraining method that uses permutation-based training to capture bidirectional context while maintaining autoregressive formulation, overcoming limitations of masked language modeling.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xlstm",
      "term": "xLSTM",
      "definition": "Extended Long Short-Term Memory is a modernized LSTM architecture that introduces exponential gating and novel memory structures for competitive language modeling.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xml-prompting",
      "term": "XML Prompting",
      "definition": "A prompting technique that uses XML tags to structure prompt sections, delimit input data, and specify output format, leveraging hierarchical markup to provide clear boundaries between instructions, context, and expected response structure.",
      "tags": [
        "Prompt Engineering",
        "Output Format"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xml-tags",
      "term": "XML Tags (in Prompting)",
      "definition": "Using XML-style markup tags to structure prompts and clearly delineate sections such as context, examples, or instructions. Helps models parse complex prompts more reliably by providing explicit boundaries between different content types.",
      "tags": [
        "Prompting",
        "Technique"
      ],
      "domain": "general",
      "link": "../learn/index.html",
      "related": []
    },
    {
      "id": "term-xnli",
      "term": "XNLI",
      "definition": "Cross-lingual Natural Language Inference a benchmark for evaluating cross-lingual sentence understanding across 15 languages. Extends MNLI premises with translations for multilingual NLI evaluation.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xor-filter-algorithm",
      "term": "XOR Filter Algorithm",
      "definition": "A static probabilistic data structure for membership testing that achieves better space efficiency than Bloom filters. Maps elements to positions using three hash functions and stores XOR fingerprints.",
      "tags": [
        "Algorithms",
        "Technical",
        "Data Structure"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-xp3",
      "term": "xP3",
      "definition": "A multilingual extension of P3 covering prompted templates for datasets in 46 languages. Used to train the BLOOMZ multilingual instruction-following model.",
      "tags": [
        "Training Corpus",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xquad",
      "term": "XQuAD",
      "definition": "Cross-lingual Question Answering Dataset a benchmark of 1190 SQuAD question-answer pairs translated into 11 languages by professional translators for cross-lingual QA evaluation.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xstest",
      "term": "XSTest",
      "definition": "A benchmark for identifying exaggerated safety behaviors in language models. Contains 250 safe prompts that overly cautious models incorrectly refuse to answer.",
      "tags": [
        "Benchmark",
        "NLP",
        "Safety",
        "Evaluation"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xsum",
      "term": "XSum",
      "definition": "Extreme Summarization a dataset of 226000 BBC news articles paired with single-sentence summaries. Tests the ability to generate concise abstractive summaries of news content.",
      "tags": [
        "Benchmark",
        "NLP"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xtreme",
      "term": "XTREME",
      "definition": "Cross-lingual TRansfer Evaluation of Multilingual Encoders a benchmark of 9 tasks covering 40 diverse languages. Tests cross-lingual transfer of multilingual language models.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xtreme-r",
      "term": "XTREME-R",
      "definition": "An updated version of XTREME with more challenging tasks and broader language coverage. Addresses limitations of the original benchmark in evaluating multilingual transfer.",
      "tags": [
        "Benchmark",
        "NLP",
        "Multilingual"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    },
    {
      "id": "term-xtts",
      "term": "XTTS",
      "definition": "A deep learning text-to-speech model from Coqui that supports voice cloning and multilingual speech synthesis with minimal reference audio.",
      "tags": [
        "Models",
        "Technical",
        "Audio"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xverse",
      "term": "XVERSE",
      "definition": "A Chinese large language model series supporting both Chinese and English with models ranging from 7B to 65B parameters.",
      "tags": [
        "Models",
        "Technical",
        "NLP"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xview",
      "term": "xView",
      "definition": "A large overhead imagery dataset containing over 1 million object instances across 60 classes from high-resolution satellite images. Tests fine-grained object detection in aerial views.",
      "tags": [
        "Benchmark",
        "Computer Vision",
        "Remote Sensing"
      ],
      "domain": "datasets",
      "link": null,
      "related": []
    }
  ]
}