{
  "letter": "y",
  "count": 9,
  "terms": [
    {
      "id": "term-yann-lecun",
      "term": "Yann LeCun",
      "definition": "French-American computer scientist who developed convolutional neural networks in the late 1980s and applied them to handwritten digit recognition. He serves as Meta's Chief AI Scientist and won the 2018 Turing Award.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-yarn",
      "term": "YaRN",
      "definition": "Yet another RoPE extensioN method combines NTK-aware interpolation with attention scaling for robust context length extension. Achieves state-of-the-art performance on extended context benchmarks with minimal fine-tuning.",
      "tags": [
        "Algorithms",
        "Technical"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-yeo-johnson-transformation",
      "term": "Yeo-Johnson Transformation",
      "definition": "A power transformation similar to Box-Cox that can handle both positive and negative values. It extends the Box-Cox transformation by defining appropriate transformations for non-positive data.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-yi",
      "term": "Yi",
      "definition": "A series of open-source bilingual (Chinese/English) LLMs from 01.AI. Known for strong performance across benchmarks and contributing to open-source AI development in Asia.",
      "tags": [
        "Model",
        "Open Source"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-yolo",
      "term": "YOLO (You Only Look Once)",
      "definition": "A real-time object detection algorithm that processes images in a single pass. Revolutionary for its speed, enabling real-time video object detection on standard hardware.",
      "tags": [
        "Architecture",
        "Computer Vision"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-yolov5",
      "term": "YOLOv5",
      "definition": "A popular implementation of the YOLO object detection family released by Ultralytics in PyTorch. Known for ease of use fast training and strong performance. Widely adopted in production computer vision applications.",
      "tags": [
        "Models",
        "Technical"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-yolov8",
      "term": "YOLOv8",
      "definition": "A state-of-the-art real-time object detection model in the YOLO family that introduces an anchor-free detection head, decoupled classification and regression branches, and improved training strategies.",
      "tags": [
        "Computer Vision",
        "Object Detection"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-yoshua-bengio",
      "term": "Yoshua Bengio",
      "definition": "Canadian computer scientist who made foundational contributions to deep learning, including neural language models and generative adversarial networks. He shared the 2018 Turing Award with Hinton and LeCun.",
      "tags": [
        "History",
        "Pioneers"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-yoshua-bengio-universal-approximation",
      "term": "Yoshua Bengio Universal Approximation",
      "definition": "The 1989 work by George Cybenko and subsequent contributions by Kurt Hornik and others proving that neural networks with a single hidden layer can approximate any continuous function. This universal approximation theorem provided theoretical justification for neural networks.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    }
  ]
}