{
  "letter": "z",
  "count": 10,
  "terms": [
    {
      "id": "term-z-score",
      "term": "Z-Score",
      "definition": "A standardized score indicating how many standard deviations a data point is from the mean of its distribution. It allows comparison of values from different distributions on a common scale.",
      "tags": [
        "Statistics",
        "Data Science"
      ],
      "domain": "algorithms",
      "link": null,
      "related": []
    },
    {
      "id": "term-zephyr",
      "term": "Zephyr",
      "definition": "A series of fine-tuned open LLMs from Hugging Face optimized for helpful assistants. Demonstrates how smaller models with good alignment can outperform larger base models.",
      "tags": [
        "Model",
        "Open Source"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-zero-optimization",
      "term": "ZeRO Optimization",
      "definition": "Zero Redundancy Optimizer, a distributed training technique that partitions optimizer states, gradients, and parameters across data-parallel processes to reduce memory redundancy.",
      "tags": [
        "LLM",
        "Generative AI"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-zero-day",
      "term": "Zero-Day (AI Context)",
      "definition": "Novel vulnerabilities or attack vectors discovered in AI systems before developers know about them. AI security research increasingly focuses on finding such vulnerabilities proactively.",
      "tags": [
        "Security",
        "Safety"
      ],
      "domain": "safety",
      "link": "ai-safety.html",
      "related": []
    },
    {
      "id": "term-zero-shot-cot",
      "term": "Zero-Shot Chain-of-Thought",
      "definition": "Adding \"Let's think step by step\" to a prompt to trigger reasoning without providing examples. A simple but effective technique for improving accuracy on complex tasks.",
      "tags": [
        "Prompting",
        "Reasoning"
      ],
      "domain": "general",
      "link": "../learn/index.html",
      "related": []
    },
    {
      "id": "term-zero-shot",
      "term": "Zero-Shot Learning",
      "definition": "When AI performs a task without examples in the prompt, relying entirely on pre-trained knowledge and instructions. Contrasts with few-shot where examples are provided.",
      "tags": [
        "Prompting",
        "Technique"
      ],
      "domain": "general",
      "link": "../learn/index.html",
      "related": []
    },
    {
      "id": "term-zero-shot-learning-history",
      "term": "Zero-Shot Learning History",
      "definition": "The development of zero-shot learning from early attribute-based approaches to modern large language models that perform tasks without task-specific training examples. GPT-3 (2020) demonstrated remarkable zero-shot capabilities through large-scale pre-training.",
      "tags": [
        "History",
        "Milestones"
      ],
      "domain": "history",
      "link": null,
      "related": []
    },
    {
      "id": "term-zero-shot-ner",
      "term": "Zero-Shot NER",
      "definition": "Named entity recognition performed on entity types not seen during training, using natural language descriptions of entity categories to generalize to new entity types without additional labeled data.",
      "tags": [
        "NLP",
        "Text Processing"
      ],
      "domain": "general",
      "link": null,
      "related": []
    },
    {
      "id": "term-zero-shot-object-detection",
      "term": "Zero-Shot Object Detection",
      "definition": "The ability to detect and localize objects of novel categories without any training examples, using vision-language alignment to match text descriptions of new categories to visual regions.",
      "tags": [
        "Computer Vision",
        "Object Detection"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-zero-trust-architecture-for-ai",
      "term": "Zero-Trust Architecture for AI",
      "definition": "A security framework that requires continuous verification of all users devices and AI components regardless of their position within or outside the network boundary. Adapted for AI system security.",
      "tags": [
        "Safety",
        "Technical"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    }
  ]
}